[
	"<img id=\"titleImage\" src=\"/img/covers/mosquito_song_front.jpg\" height='600'>",
    "The Mosquito Song",
    "<h3 class=\"chapter\">Chapter 1</h3>\n<p>The hardest part about being a vampire is the hours. Don’t get me wrong; nowadays, there are a lot more TV channels and late-night drive-thrus running in the small hours than, say, the Reagan years. Still in Anytown, USA your dusk till dawn options tend to be limited to laundromats, Walgreens and the occasional supermarket.</p> \n<p>I find myself in such a supermarket now, going back and forth between new red and Yukon gold potatoes. I decide to get the red ones as they are on sale and throw a five pound bag carefully into my basket so as not to crush the asparagus and generic pop tarts already there.</p> \n<p>It’s a glamorous and sexy life, I know.</p> \n<p>Most people think that vampires don’t drink anything but human blood and don’t eat anything but, I don’t know, rats and spiders. Then again, most people think that mosquitoes subsist solely on blood. Well, we don’t and they don’t. The way I hear it, female mosquitoes drink blood as their form of prenatal vitamins. Every time you slap a mosquito, you’re killing a pregnant momma or something along those lines. The males never even drink blood and just munch on nectar.</p> \n<p>Bet you didn’t know vampires were so educational. We tend to read a lot. It ties into that whole “nothing is open at night” business.</p> \n<p>The supermarket is sterile and empty. Unseen speakers play a Muzak version of a song I used to like. A few folks are off in the distance shuffling like zombies around an end cap of some product that apparently requires a lot of exclamation points. I thought we were done with this “extreme” nonsense.</p> \n<p>I throw some liver into my basket.</p> \n<p>My mind wanders.</p> \n<p>Digestively, vampires are very efficient. We don’t often have to use the toilet. I did last week, but only because something I ate had a lot of garlic in it. Garlic repels vampires in the way that a nice glass of milk repels the lactose intolerant.</p> \n",
    "<p>Now, using fuel effectively is the cornerstone of monster sustainability. No amount of efficiency, however, can reconcile the necessary blood capable of providing the recommended daily caloric intake of a three hundred pound creature and said creature’s need to maintain a covert lifestyle. Vampires need blood, but the undead can’t (un)live by blood alone. Besides, plasma and potatoes go together quite nicely.</p> \n<p>Mind you, I didn’t pull the three hundred pound estimate out of my ass. I’m five foot eight with a twenty-eight inch waist, and that’s what I weigh.</p> \n<p>It’s complicated.</p> \n<p>I hate these little supermarket baskets. I don’t know why I use them. Honestly, I think they make things harder to carry. I decide that I hate this supermarket. At least, I try to hate this supermarket. Instead my body settles on a general feeling of apathy towards it and everything else around me.</p> \n<p>I need a project.</p> \n<p>I need to do something productive. Maybe I’ll do a socioeconomic experiment. You know? Maybe I’ll go out to Utica and eat all their homeless. Are there homeless people in Utica? Maybe I should just kill all the hairdressers in Ashtabula.</p> \n<p>Why do supermarkets have to be so damned bright? It makes me feel as though I have a hangover. I shouldn’t need to wear sunglasses indoors.</p> \n<p>Maybe I can grow to hate this place.</p> \n<p>The movies portray a lot of all-hours vampire discotheques, but I’ve never seen these things. Maybe they are in the bigger cities. Problem with big cities are the expenses. I became a vampire in 1983 with twenty thousand dollars in cash; I thought that was a lot of money.</p> \n<p>Heh.</p> \n<p>I’ve bounced around a lot in the last twenty five years. Mostly in the Midwest and the rust belt. Once I made it as far as Vegas. Vegas wasn’t bad; things were always open. Vamps there were cliquish and nasty, though. I wore out my welcome pretty fast. I tend to do that thing.</p> \n",
    "<p>I’m told New York City never sleeps. I couldn’t afford to rent a closet there. Maybe I could. Go to sleep standing up in a coffin sized closet; that sounds fitting.</p> \n<p>I total up the cost of the food in my basket and compare that number to the cash in my pocket. There is still a little wiggle room. Perhaps I have enough money for some salami. Why is hard salami so damned expensive, anyway?</p> \n<p>I lived in a storage locker in Chicago for a bit. That was back when I had my own car. Chicago killed my car. My license plate got stolen one night and the cops gave me a ticket for not having one. I didn’t park on the right side of the road for street cleaning and I got a ticket. I didn’t move the car after it snowed more than two inches and I got a ticket. I think my car is still in Chicago, wearing that infernal boot.</p> \n<p>A light glows above only one of the checkout lanes. An eighteen year old girl with dark and curly hair sits there, staring at one of those <i>Twilight</i> novels. She’s good looking, at least for this town. Her nametag reads “Mindy”. This Mindy looks up from her book and says, “only five things.”</p> \n<p>I’m not sure if that was intended to be a question, as it sounded like an insult. I reply, “All that budget permits, dear.”</p> \n<p>She half-snorts at me, then freezes. She’s not scanning anything. We stare dumbly at each other for thirty-seven seconds, during which time I wish I had some of that fabled vampire telepathy.</p> \n<p>“Bonus card.” Once again, what should be phrased as a question sounds a lot like an insult.</p> \n<p>“I'm not from around here,” I respond. Well, I was born only about an hour away. It just doesn’t feel like it. Home is a moving target.</p> \n<p>A lanky kid gets in line behind me. He’s dressed in black, shiny clothes and is carrying a well-worn backpack. He holds the biggest jar of peanut butter I’ve ever seen.</p> \n<p>“18.97,” Mindy demands.</p> \n<p>“I only have eighteen.” Goddamned bonus cards, those potatoes weren’t really on sale.</p>",
    "</p> \n<p>I start to put back the toaster pastries when the lanky kid says, “I’ve a dollar. Here ya go.” I thank him and notice the crucifix tattoo covering his carotid. He looks way too soft to be a gangster.</p> \n<p>Well, it has been over a year.</p> \n<p>I collect my three pennies and my two bags of groceries. I pass an out-of-order claw machine, walk through the automatic doors, and lean against the building. The lanky kid exits ten seconds behind me.</p> \n<p>“Oh, hey. Don’t worry about getting me that dollar back.” His voice tremors as though he were asking a cheerleader to the junior prom. “Did you, uh, need a ride or something?”</p> \n<p>“Sure, kid. Lead the way.” We might as well do this away from the building. “What’s in the bag?”</p> \n<p>“Oh, my, uh, library books. Mostly books. This is my van.”</p> \n<p>Sigh.</p> \n<p>“Kid, you’re less subtle than a pedophile.”</p> \n<p>He started to say “I don’t know what you mean” before going after me with a stake. His right hand comes down like Anthony Perkins in Psycho. Not wanting to drop my groceries, I step to the side while chopping the top of his right wrist with my left hand. The stake plunges into the kid’s leg, just missing the femoral artery. He leans against the van, and falls to a seated position like the protagonist of every chick flick. I get a potato out of my bag, bite into it like an apple, and step on the stake.</p> \n<p>“So,” I say, “anything cool in the bag?”</p> \n<p>He spouts out a string of obscenities that make less sense the more you think about them. “This is a really good potato,” I tell him. It really is. I search through the backpack and pull out something that looks like a ham radio.</p> \n<p>“Hey kid, you a ham?”</p> \n<p>“Fuck you.”</p> \n<p>I step on the stake some more. “Listen, I just fed not too long ago. I’m sure </p>",
    "<p class=\"noindent\">you have a cell phone. I can let you use it if you just humor me for a bit here. Huh? Or you can die a slow death in the parking lot of a grocery store.”</p> \n<p>“It’s an electro-magnetic interferer. It irritates your ampullae of Lorenzini. You’re in-”</p> \n<p>“Wait. You realize that I’m not a shark right? That’s a shark repellent.”</p> \n<p>“The guy told me-”</p> \n<p>“You are the worst vampire hunter I’ve ever encountered. You’re even worse than the people who are purposefully incompetent because they think I’ll ’turn’ them. You didn’t want me to turn you did you?”</p> \n<p>“Fuck you.”</p> \n<p>“Most people can’t be turned. I’d explain why, but-”</p> \n<p>“Fuck you.”</p> \n<p>“Yeah, I heard.” I rummage through his bag some more. He’s got some useless crap that wards off vampires in bad movies, some homemade crap I can’t make heads or tails of, and a bunch of stuff that is actually dangerous to vampires. He’s also got peanut butter, a wallet full of cash, and a cell.</p> \n<p>“You’re a parasite,“ he tells me. It’s an interesting choice of words. “You do nothing but steal. You do nothing but take. You don’t produce anything. You add nothing to society. You-”</p> \n<p>“Seriously? I’m made out of darkness and nightmares and you talk about me as though I were a welfare queen? I’m a goddamned vampire, not Octo-mom.”</p> \n<p>He gathers up what I assume to be the lot of his courage and tells me, “you would squander immortality.” The kid snatches a rosary from his pocket and throws it at me.</p> \n<p>I catch it in my left hand. “Well, eternal youth is wasted on the eternally young. Where’d you get this, your cotillion?” </p> \n<p>“It has been blessed by-”</p> \n<p>“I was blessed myself in 1953. Never noticed the difference. Now quiet a minute; I’m using the phone.”</p>",
    "</p> \n<p>I call 911. “Hello. My friend here accidentally impaled himself. He’s bleeding pretty bad and we could use an ambulance.” I give the operator our location. “Oh, and he has a busted ankle, too.”</p> \n<p>“I do not.”</p> \n<p>I probably don’t have to tell you what happens next. It involves a lot more obscenities from him.</p> \n<p>I chuck the phone onto the roof of the supermarket and drag the kid over to my old stolen car. His van is going to become my new stolen car. I tell the kid to keep pressure on his wound and then I step on the stake again. He mumbles something about the lord being his shepherd.</p> \n<p>“A <i>Vicar of Dibley</i> fan, eh?”</p> \n<p>His van has captain’s chairs and is remarkably comfortable. Still, as I pull out of the parking lot, I feel a heavy thing growing in my stomach.</p> \n<p>How did an idiot like that find me?</p> \n<p>And where did he get that non-useless stuff in my new backpack?</p> \n<p>Serves me right for wanting a new project.</p> \n<h3 class=\"chapter\">Chapter 2</h3> \n<p>For a derelict vampire, the best part about winter north of the Mason-Dixon is the existence of snowbirds. People abandon perfectly nice houses for months at a time in order to avoid shoveling snow. Finding these empty houses isn’t terribly difficult. Paperboys usually forget to stop throwing the paper on the porch until there is a stack of four. The tricky part is slowly driving a van through a quiet neighborhood at night, and not looking like some sort of burglar or pederast.</p> \n<p>I find a house that suits my needs surprisingly quickly. Perhaps my luck is about to change. I keep driving for a half mile, until there are no streetlights and nothing around but trees. I finish eating my store-bought liver, and cram all things useful into my new backpack. I end up having to shove a few potatoes in my coat pockets.</p> \n",
    "<p>Suburbs and small towns don’t really have pedestrians. When everybody drives everywhere, walking becomes suspicious, let alone walking on the side of a dark road a couple of hours before dawn. If you’re in a big city, you can wander down the middle of the street in the middle of the night, shirtless and drinking blood out of a Gatorade bottle and nobody will find it odd. You can’t get away with that sort of thing in a Podunk town.</p> \n<p>But like every restaurant will eventually have roaches, every town eventually has joggers. Running and walking breed mistrust, but jogging just breeds a mild level of innocuous contempt.</p> \n<p>It takes me five minutes to get back to the house.</p> \n<p>A couple of years ago, I kept a collection of garage door openers to help me get into these places. While that might sound like a great idea, it sucks in practice. I ditched them when one accidentally opened a neighbor’s door at four in the morning and their dog started barking like mad. Nowadays, I just carry a couple of bobby pins and an old library card for this sort of thing. Bobby pins are surprisingly good at any number of things, and library cards tend to be thinner and more flexible than credit cards when used as a shim.</p> \n<p>The library card gets me into the snowbird’s garage with minimal effort. I check the light switch, and sure enough they didn’t bother shutting off the power. Working lights might mean food in the freezer, and maybe even heat.</p> \n<p>Easy living.</p> \n<p>The garage is well organized, with a toolbox for every tool, a shelf for everything else, and two cars gently tucked away for the winter. The door connecting the garage to the house isn’t even locked. I drop my bag onto the kitchen table and take a look around.</p> \n<p>No pets or plants that need to be watched, so I shouldn’t have to worry about being spotted by any variety of sitter. There are some frost-covered boxes of foodstuffs in the freezer, and a fridge full of condiments. The living room has a large, fluffy couch, a </p>",
    "<p class=\"noindent\">decent television, and what must be three hundred movies on VHS. I check the thermostat in the hall; the heat is working and set to fifty-eight degrees. That’ll do.</p> \n<p>The basement is big and dark and contains another freezer with somewhat less antiquated food. There is also a bookshelf overrun with canned goods. Some people never got out of that Cold War bomb shelter mentality.</p> \n<p>You know what old people have in their houses? Answering machines. The only people still using answering machines are the ones who could never figure them out in the first place. Their away message indicates they’ll be away for another week. How nice of them to give us all a window of the best time to burgle their home and rifle through their belongings.</p> \n<p>Thank you, Jack and Barb.</p> \n<p>Best of all, Jack and Barb are the type of people who keep their keys on a conspicuous hook in a central location.</p> \n<p>With labels.</p> \n<p>I pocket one key labeled Barb’s car; it’ll save me the trouble of hotwiring that thing. Another tag catches my eye: lock box. It takes me three and a half minutes to find the lock box in the back of the snowbirds’ bedroom closet. For the most part, the box contains dental records, medical records, useless certificates, and various bits of superfluous paperwork trailing back to 1978.</p> \n<p>But I also find a slip of paper containing the words “Safe Combination” and a set of directions on how to open said safe. (Spin it three times to start.)</p> \n<p>I love old people.</p> \n<p>I waste six minutes looking for their safe behind pictures and in various closets. Jack and Barb didn’t get that cute though. As it turns out, the safe is just underneath their bed. I’m surprised that wasn’t written down as well.</p> \n<p>I pocket five hundred dollars in twenties and fifties in order to teach them an important lesson about theft proofing their home. I put everything back where it goes, shut off all the lights and head back towards the basement. Down there, it won’t be so conspicuous that this house is no longer empty.</p>",
    "</p> \n<p>I pull the string on a hanging light bulb, empty my new backpack onto an old card table, and take a seat on an easy chair that’s been clawed to shreds by a long dead cat.</p> \n<p>I push aside my groceries and the kid’s peanut butter. I grab the wallet first. I pocket the cash and a couple of notes that the kid wrote with names and telephone numbers. There are only three names on the notes. Fuck. I should’ve kept the cell phone long enough to look at his contacts. The kid’s name is apparently Hugh Sommers, at least, according to his driver’s license, his Blockbuster video card, his Humana Insurance (still on his dad’s plan), and three credit cards. Hugh has a picture of himself at the junior prom standing next to a girl who looks like whassername from “Bones”. Stuck to the back of the photo is a business card.</p> \n<p>BLOODSUCKING FREAKS</p> \n<p>Videos, Novelties, Swank.</p> \n<p>It has a Chicago address. I see a road trip in my future. I take the card, still stuck to the photo, and toss the wallet full of ID onto a pile of laundry.</p> \n<p>What else did Hugh have in his sack?</p> \n<p>One obnoxiously large crucifix with a big miserable Jesus on it: Jack and Barb, I’ll leave that as my gift to you, for your hospitality.</p> \n<p>One small bottle of Bohemian Absinth: Like regular absinthe, it’s distilled from wormwood and fairly dangerous to bloodsuckers. This isn’t enough to kill one, but could probably be used like a morning after pill for vampire infection.</p> \n<p>One squirt gun full of (what I can only presume to be) Holy Water: Holy Water tends to have the distinct musty smell of Catholicism all over it. Maybe Jack and Barb have a grandson that could use this thing?</p> \n<p>Three odd-looking meters of some sort: They look like the sort of things Tom Cruise would use to tell you how many thetans were trapped in your body. Each is labeled “Scantech Industries”, a business run by a conman named Siodmak out of a basement in LaPorte, Indiana. Nice guy, though.</p> \n",
    "<p>One nasty-looking syringe: I figure the needle to be titanium, very thick but very sharp and made for puncturing vampire sternums. The syringe contains 10 cubic centimeters of liquefied mugwort. No vampire could survive this sort of stake to the heart. We’ll empty this one in the utility tub.</p> \n<p>Numerous mirrors: I can see my reflection in them. Man it would be cool if I couldn’t.</p> \n<p>One of those heavy duty flashlights that can also serve as a Billy club: A useful thing to carry.</p> \n<p>A manila envelope: You know what’s weirder than seeing your name on a file you stole from a stranger? Not immediately recognizing your own name. Pictures of me, names and dates, photocopies of official-looking documents and all sorts of tiny printed paragraphs.</p> \n<p>Hey, I was officially presumed dead until 1995. I didn’t know that.</p> \n<p>There’s got to be 50 pages worth of notes here. I need a good day’s sleep before I can soak in that much information.</p> \n<p>I rest my feet on the card table and pull the string to turn off the light. I am snoring within minutes.</p> \n<p>It is about two hours later when the doorbell rings.</p> \n<h3 class=\"chapter\">Chapter 3</h3> \n<p>After invading somebody’s home, there are worse noises to hear than the ding-dong of a doorbell; it’s just hard to come up with any of those things when it is happening to you. They, the proverbial they, call the reaction “fight or flight”. I’ve always found that rather dismissive of the lie and hide options.</p> \n<p>I hear keys jingle.</p> \n<p>Crap.</p> \n<p>I start to gather my things.</p> \n<p>In most instances like this one, lying is a great option. If you pretend that you </p>",
    "<p class=\"noindent\">are supposed to be there and are assertive enough, people might just believe you. If they know you aren’t supposed to be there, most people just think that you’re a confused idiot. You say, “whoops,” and leave. No one hassles you too much as long as nothing is obviously missing or destroyed.</p> \n<p>I wedge myself under the basement stairs, having chose the hide option. Hiding under the basement stairs is a bad choice if a monster is chasing you, but good choice if you are the monster. Same thing goes for closets and the undersides of beds.</p> \n<p>I hear the front door open. I’ve got a visitor.</p> \n<p>Lying is a relatively safe option, for a human. Most people could pull it off after an hour’s worth of playing with an improv group. For vampires, it is a high-risk venture. You see, us bloodsuckers emit some sort of chemical or hormone or lord knows what. It makes people go a little wild, some hostile, some. . . let’s say amorous, some terrified. This thing is a good thing if you are looking to increase the chances of some delicious and nutritious blood being spilled. Sucks if you want to maintain a low profile.</p> \n<p>The door closes and I hear footsteps about where the living room should be. It gets quiet.</p> \n<p>As a rule, homeowners don’t ring their own doorbells, nor would a house sitter. Salesmen, UPS guys and burglars usually don’t have front door keys. When squished underneath a staircase, there is enough room to think and little else.</p> \n<p>A toilet flushes upstairs. I hear the creaking of floorboards, but no sounds I can specify to any particular action.</p> \n<p>A maintenance man? A neighbor making sure the pipes don’t freeze? One thing is for certain: it isn’t a good time to go back to sleep. If my visitor comes down here, I should be fairly concealed by stairs and a shelf of canned soups.</p> \n<p>So, I bide my time.</p> \n<p>Ten minutes pass, still nothing but vague creaks and squeaks.</p> \n<p>Sunlight creeps towards me from a window the size of a large envelope, enough sunlight so that I should be able to read. I look at that fat file with my name on </p>",
    "<p class=\"noindent\">it. Each page has some computer mumbo jumbo at the bottom, giving the whereabouts of the electronic copy of this thing.</p> \n<p>In their words:</p> \n<p><i>Born Buffalo, NY, February 2nd, 1954.</i></p> \n<p><i>Third of three children.</i></p> \n<p><i>Father was a steelworker, died of cancer in 1958.</i></p> \n<p><i>Family relocated to low-income housing in Niagara Falls.</i></p> \n<p><i>Attended 99th street school.</i></p> \n<p><i>Oldest child dies, unknown ailments, 1963.</i></p> \n<p><i>Middle child dies, unknown ailments, 1974.</i></p> \n<p><i>Mother dies, suicide, 1975.</i></p> \n<p>I am interrupted by the sound of a woman screaming. Then another.</p> \n<p>Now moaning.</p> \n<p>And then the unmistakable score to a blue movie. My mystery visitor has come here to watch porn. I guess I won’t have to worry about being really quiet down here. I go back to the file.</p> \n<p><i>Mother dies, suicide 1975.</i></p> \n<p>I haven’t thought about it in a long time. I prefer to keep that streak alive.</p> \n<p>The next few pages are yearbook photos and random group shots with tiny captions, college transcripts, dental records, vaccination records, and some employment history. Apparently all prospective vampire hunters should be aware that I had a stupid haircut as a teenager, that I never understood Thomas Aquinas, that I had a filling in a baby tooth, and that I spent a summer working at Carvel’s.</p> \n<p>After that useful information, the next two pages are PDFs of photocopies of mimeographs of a police report I filed against a guy who stole my blue jeans out of a shared dryer in 1975.</p> \n<p>Just when I think this file can’t possibly get more frustrating: squiggles.</p> \n<p>Thirty-five pages of squiggles.</p> \n",
    "<p>Like someone drawing seagulls in the distance with a calligraphy pen. Someone, presumably Hugh, has scribbled on one of the pages “WTF?! Arabic?”</p> \n<p>I know it isn’t Arabic. Before I can figure out what it could be, I hear footsteps. Loud footsteps. The kind made by wooden soled shoes.</p> \n<p>I set my file down and listen. They are coming closer. I contort my body to make the best use of the available shadows. The basement door opens. I freeze. I breathe slowly through my nose as the stair above my head bows. Situations like this always make me feel like sneezing. I wiggle my philtrum against my septum; that seems to help.</p> \n<p>Between two cans of sirloin burger, I see him. He’s big, around fifty years old, and has a handlebar mustache that makes him look like Stalin. He wears a satin purple teddy, black heels and a silver, y-shaped necklace. He’s sporting those high-end breast pads with fake nipples that mastectomy patients sometimes wear.</p> \n<p>Stalin pulls at strings, turning on lights as he walks to the fridge, one foot directly in front of the other. His walk is a ridiculous exaggeration of film noir style femininity, a mime’s impersonation of Jessica Rabbit. Though, I’ve seen women do worse in heels, clomping around like lip-sticked Velociraptors.</p> \n<p>Stalin makes it to the fridge, unearths a Rocket Pop. He fellates the freezer burn off the frozen red, white and blue corn syrup as he sways back to the stairs, pulling the strings to turn off the lights now. When I was a young man, this sort of thing was considered abnormal behavior.</p> \n<p>That was before the internet.</p> \n<p>A cell phone rings and Stalin makes an awful racket running up the stairs in his heels. He yells something into the phone about fixing Jack and Barb’s sump. He tells the cell phone that he loves it and will be home as soon as he can.</p> \n<p>He spends the next 5 hours watching porno. Even in the age of the internet, I consider tantric masturbation abnormal behavior.</p> \n",
    "<h3 class=\"chapter\">Chapter 4</h3> \n<p>I stare at the squiggles for three hours, looking for any sign of a Rosetta Stone. I can’t even figure out if it is coded English, or another language. Or another language coded. Eventually, I fall asleep having made no discernible progress.</p> \n<p>It is dark outside when I wake up. I am full of a mild hatred of the world and all its things. I want to hide under the stairs. The cement floor is cool and smooth and covered with a thin layer of powder that cannot rightly be called dirt or dust.</p> \n<p>I lie down and stare up at the bottoms of the wooden steps. Their latest paint job only bothered with the tops and the sides; only a few brushstrokes reached the bottoms, like those stairs were wearing baby blue vests.</p> \n<p>I don’t want to do anything. I just want to lie underneath these silly stairs, feel the cold cement on the backs of my arms, and breathe in the musty air.</p> \n<p>I get up anyway.</p> \n<p>I’ve got to keep moving. Hugh might have competent friends out looking for me. Keep moving and figure out who is trying to kill me.</p> \n<p>I open up my bag and throw all my stuff back in, plus three cans of soup. I head upstairs and steal a spoon from the snowbirds. Chicago is my best bet, or at least my only workable lead. I open a can of sirloin burger while thinking about Italian beef, polishes, and pork chop sandwiches. The spoon makes a pleasant noise, rubbing against the ridges inside the can. The soup has an aftertaste that reminds me of nickels.</p> \n<p>It’s good soup.</p> \n<p>Chicago, I might have a few friends left in Chicago.</p> \n<p>It’s probably just a stupid video store. It’s probably nothing. It’s probably just a waste of time. Thankfully, I have a surplus of that particular resource.</p> \n<p>Let’s go steal Barb’s car.</p> \n<p>Both cars are still resting, warm in their winter blankets as I enter the garage. </p>",
    "<p class=\"noindent\">Uncovering a corner of the nearest vehicle reveals a bright purple fender that would make a pimp blush. Barb’s car does look like a sporty little thing, though.</p> \n<p>I press the unlock button on her keychain; the noise comes from the other car. I put the purple nightmare back to bed, and head towards a much larger car cover. As I throw the cover off Barb’s actual car, my hate of everything in the world is diminished.</p> \n<p>It’s perfect: a few years old, but clean, simple and dark.</p> \n<p>Driving across that region of America near the Great Lakes, you learn a few things. You learn that most cops won’t bother you if you are only going nine miles per hour above the speed limit. Almost none will bother you for four. You learn that Wisconsin police hate anybody with Illinois plates and will use any excuse in order to pull over a vehicle displaying such an affront as the “Land of Lincoln” motto. You learn that Ohio is interminably maggoty with construction. You learn that you can safely fall asleep while driving through Pennsylvania.</p> \n<p>And you learn that the official car of Big Brother is the Ford Crown Victoria. She may not be as ubiquitous as she was a few years ago, but she is still a preferred choice for G-men of all shapes and sizes.</p> \n<p>When you are in a Crown Vic no one dares cut you off, traffic moves aside for you, cops don’t hassle you, and life is generally good. I throw my bag in the passenger seat and head back into the house.</p> \n<p>There is a large spiral notebook next to the answering machine. I flip through a few pages with names, numbers, and doodles, and rip out the first clean sheet.</p> \n<p>I write.</p> \n<p>“Dear Jack and Barb,</p> \n<p>Thank you so much for your involuntary hospitality. It was a pleasure to stay at your lovely home during this cold winter season. You will find that I left the place in, more or less, the same state that I found it. This is minus, of course, three cans of delicious sirloin burger soup. (The missing Rocket Pop can be attributed to your mustachioed friend whom I assume to have an uptight home life.)</p>",
    "</p> \n<p>You may also notice that I have borrowed a sizable sum of money and one of your automobiles. I am sorry that I did not ask you to lend me these supplies ahead of time, but my present situation demanded immediacy in their use. Your forgiveness seemed to be more accessible than your permission. Rest assured, I have left you some collateral. First, my wallet (full of my ID and credit cards) can be found atop your laundry pile. In your basement you will also find that I have left you my cherished family crucifix. Please take special care of that cherished heirloom.</p> \n<p>I fear I will not be able to return Barb’s car personally. If this is the case, I shall leave it in a long-term parking lot adjacent to the Bangor International Airport.</p> \n<p>Thanks again.</p> \n<p>Sincerely,”</p> \n<p>I run to the basement’s laundry pile and grab the driver’s license out of Hugh’s wallet. I stick it under the letter and trace Hugh’s signature. The rest of the handwriting won’t match, but it’ll be enough to keep the kid’s life interesting for a few days.</p> \n<p>I back the car out of the garage, then lock up the house. I drive down more than a few roads without streetlights. Big, fat snowflakes drift down from the sky.</p> \n<p>The Crown Vic has a smooth ride. In half an hour’s time, I stop at a gas station near the Silver Creek entrance of interstate ninety. Being on a reservation, the gas is fairly cheap. I pull the car up next to pump one, throw on my backpack, and walk into the mini-mart. It’s full of cigarettes at wholesale prices.</p> \n<p>I hand the blonde behind the counter thirty dollars but only manage to squeeze twenty-four dollars worth into the gas tank. The blonde smiles at me as I walk back in to get my change. “I tried my best,” I tell her. Her nametag says her name is Nicole.</p> \n<p>I wonder aloud if I can get my six dollars change paid in jerky. Nicole obliges this previously hypothetical request, handing me jerky and twenty-seven cents change. As I tuck these things into my backpack, Nicole asks if we’ve met before.</p> \n<p>I respond, “All alone, at this hour, it isn’t really safe for a girl like you to be flirting with customers.”</p> \n",
    "<p>Nicole looks me up and down. “Believe me, I’ve had more than my share of ugly, lovesick truckers come around here. I know how to make them feel pretty damned unwelcome.” She pauses, glancing underneath the counter. “And if I was flirting with you, I’d start by telling you how nice you smell. It sort of reminds me of. . .”</p> \n<p>Nicole doesn’t get to finish this thought as a bullet crashes through the window of the mini-mart. I feel something sharp hit me in the back.</p> \n<p>I fucking hate getting shot.</p> \n<p><b> </b></p> \n<p><b>Chapter 5</b></p> \n<p> </p> \n<p>I dive behind a shelf packed with cartons of Niagara brand cigarettes. Something wet drips down my back. I take off my backpack and coat to assess the damage, turning my head towards the counter to check on Nicole. I don’t see her.</p> \n<p>But I don’t see the multi-line telephone either.</p> \n<p>Soon, I can hear her from underneath the counter. She explains the location of this gas station by means of the nearest Tim Horton’s donut shop. She’s already called 911. Her voice is clear and steady. People ordering pizza should be so composed.</p> \n<p>I examine the bullet hole in the pack. The hole continues through all fifty pages worth of squiggles. There are two holes in a can of sirloin burger soup. (“I am sorry,” said the soup, “I have nothing left to give you.”) The hole stops short of my back. I can feel a flattened bullet inside the lining of my coat. I’d say our shooter has a good handgun or a crappy rifle.</p> \n<p>And the pack will need a wash.</p> \n<p>I hear another gunshot, but don’t see its results. Nicole stops talking, so I ask her if she is all right. She tells me that she’s fine as though we were old friends who chanced upon each other in the supermarket. This woman was carved out of granite.</p> \n<p>I look out the window to try to see our attacker. It is too bright in here and too dark out there to get much more than a reflection from the windows. I can feel the cold winter air blow in through the holes in the glass. I ask the empty counter, “Can you see the shooter on the security camera?”</p>",
    "</p> \n<p>“It’s fake. Not hooked up to anything. I just got a black and white TV back here. I was watching ’Cheaters’.”</p> \n<p>Let’s try this again. “Would you be able to turn off the lights without, uh, exposing yourself?”</p> \n<p>The lights go off; I guess she can do that thing. I tell her, “Thanks.” There is less glare now, but I’m still not capable of seeing just who is firing at us.</p> \n<p>“Earlier, you implied that you have some sort of gun or weapon or something under the counter.” It was almost a question.</p> \n<p>Nicole replies, “Well, yeah, a shotgun.”</p> \n<p>Hope rising.</p> \n<p>“But it sucks,” she adds.</p> \n<p>Hope fading.</p> \n<p>“How bad is it?” I ask.</p> \n<p>She answers, “A twelve gauge, crooked site, filled with birdshot.”</p> \n<p>“Well, it’s something.”</p> \n<p>“Yup, it’ll be great if our guy turns out to be a slow-moving pheasant.”</p> \n<p>She makes a valid point.</p> \n<p>Another gunshot knocks down a cardboard cut-out of the Marlboro man.</p> \n<p>“Hey, guy,” I hear Nicole say. “Is this like, the dumbest robber in the history of mankind? He’s firing blindly. What do you think: he’s out there stealing gas or something? Why can’t he just come in and ask for the money?”</p> \n<p>“That would be the polite thing to do were he a robber. Maybe he’s not.”</p> \n<p>“Oh, so he’s the dumbest assassin in the world?”</p> \n<p>“Can you think of anybody that wants you dead?” I ask her this question, secretly hoping the answer is yes.</p> \n<p>“Not off the top of my head.” Drat. “You?”</p> \n<p>A cinderblock smashes through what remains of the glass. That shattering noise always reminds me of the high keys on a piano. A moment after the last note is </p>",
    "<p class=\"noindent\">played, brightly colored water balloons start coming in through where the window used to be.</p> \n<p>“I might have a few people that want me dead.”</p> \n<p>“Did that guy just throw balloons in here?” Nicole asks this thing with the incredulousness it deserves.</p> \n<p>“Yeah. Water balloons.” Holy water balloons. Why yes, my life has become <i>Zombies Ate My Neighbors</i>. I betcha this douchebag would throw silver spoons at the Wolfman.</p> \n<p>“They didn’t even pop.”</p> \n<p>“I think they are frozen.” Then I realize something. “Nicole, did you see him?”</p> \n<p>“Yup. I was able to move the mirror back here with a mop handle. We got a bald guy in a trench coat. Guy’s got something that looks like a SIG Sauer. He’s standing behind the engine of his van for cover, lining up another shot.”</p> \n<p>“What’s the van look like?”</p> \n<p>She describes Hugh’s van. This guy isn’t Hugh.</p> \n<p>“It looks like he’s just gonna stand out there in the cold. Cops should be here soon. We’ll just wait’m out, I guess.”</p> \n<p>Nicole’s right. The police will be here soon. And I’m a dead man with a stolen car being shot at by a one man Monster Squad. This situation will raise questions I do not wish to address.</p> \n<p>“Listen, honey, I got to get out of here before any police show up. Is there a back door to this joint?”</p> \n<p>“Yup, right by me. It leads you out around back where the bathrooms are.”</p> \n<p>I spot the door. I can stay low and out of sight for most of the trip, save when I have to jump over the counter. I’ll need some sort of-</p> \n<p>“Guy, I’ll fire the shotgun when you gotta hop the counter. It should give you enough of a distraction.”</p> \n<p>I imagine that Nicole runs some sort of militia that will soon stage a military coup of Tonawanda.</p>",
    "</p> \n<p>“Pretend you are shooting at me when you do it.”</p> \n<p>“Why?”</p> \n<p>“This fella is trying to kill me. He thinks I’m a vampire.”</p> \n<p>Well, it isn’t a lie.</p> \n<p>“If it looks like I’m trying to shoot you, he won’t have it out for me as a vampire sympathizer.”</p> \n<p>“Naturally.”</p> \n<p>“Okey. Start crawling. I’m going to shoot on three, wide left.”</p> \n<p>I follow her orders, and land sitting next to her underneath the counter. She compliments my hopping abilities and offers me a good-bye kiss, massaging my eye teeth with her tongue. It has been fifteen years since I’ve been kissed. She tastes of Sour Patch Kids.</p> \n<p>“Why do you smell like soup, now?”</p> \n<p>I explain that thing, and go over my options. A) I run out the door and away. B) I run out the door, and hide in the bathroom. C) I run out the door, charge the guy and drive off.</p> \n<p>I check out our shooter’s position in the convex mirror. He should be able to see when we open the door.</p> \n<p>Hmm.</p> \n<p>“Nicole, I have a plan. It might be a little dangerous fo-”</p> \n<p>“I’ll do it.”</p> \n<p>“All right. I want you to grab the ladies’ bathroom key and the shotgun. You’re going to crawl out the door and into the women’s room. That should cause Trenchcoat Mafia out there to run to the side of the building, thinking he’s chasing me.”</p> \n<p>“Okey.”</p> \n<p>“You bar yourself in the bathroom and pepper him in the face if he gets time to open the door.”</p> \n<p>“Will he?”</p> \n",
    "<p>“Hopefully he won’t, as I plan to knock him out from behind.”</p> \n<p>Nicole does her part of the plan as I sit, wait, and watch. Baldy goes for it. As soon as he’s around the corner, I jump over the counter, grab two holy ice balloons, and run out the front door. As I make it to the backside of the mini-mart, I can see the shooter stare at the tracks in the snow.</p> \n<p>He lines up a shot for the bathroom door. Let’s make this count. I wind up, and launch an ice balloon at the back of his head.</p> \n<p>He falls face first into the snow. My aim is bad; he should be knocked out. I charge. He flips to his back and points the gun towards me. I toss the second ice balloon at the gun, but miss by a mile as Trenchcoat rolls backwards to his feet. He gets off a shot that hits me in the left forearm before I’m close to him.</p> \n<p>He doesn’t get off a second.</p> \n<p>I grab his right wrist with my right hand and pull him towards me and down. With my knee I pop his elbow in a direction it was never intended to bend. He drops the gun. I turn his hand, and kick his legs from under him, throwing him backwards to the snow.</p> \n<p>I break his nose, then take off my backpack.</p> \n<p>“Take off your coat,” I tell him.</p> \n<p>I take off mine, as he curses me.</p> \n<p>“Now.”</p> \n<p>He does not comply, so I step on his hyper-extended elbow. The noise makes Nicole come out of the bathroom. She looks at my arm and tells me that I’m bleeding.</p> \n<p>A tiny drop of blood travels down my forearm staining the snow. The bullet hit the arm straight on, but made only a tiny scratch. Benefit of being a monster.</p> \n<p>She notices that my blood is the color of flesh; that one’s new to me, too.</p> \n<p>“You are a vampire, aren’t you?”</p> \n<p>I take the coat from our attacker, finding time to kick him as I do so. He decides to pass out.</p> \n",
    "<p>“What does it matter to you? You offer ’em a discount on gas?”</p> \n<p>I hear a siren. Sounds about half a mile away.</p> \n<p>“It’s just kinda cool, is all.”</p> \n<p>I put on my new trench coat, and grab backpack and old coat.</p> \n<p>“Tell you what. I’ll meet you here exactly one year from now and tell you all about it.”</p> \n<p>I’m on 90 westbound by the time the cops get there.</p> \n<p> </p> \n<p><b>Chapter 6</b></p> \n<p>I’m flying past Erie, Pennsylvania and Barb’s keychain keeps hitting my leg. It’s darker than Guinness outside, I’m going eighty miles an hour, I’ve just been shot twice, and this goddamned keychain won’t stop hitting my leg.</p> \n<p>Holding the key in the ignition I yank the chain to pieces. The offending trinket is aluminum, slightly bigger than a silver dollar, and is somewhat evocative of Xena’s chakram. I had previously seen it as being round, but upon closer examination the annoyance is actually a dodecagon. I mistook twelve sides as being one. The more sides a polygon has, the more it resembles a circle. Infinity approaches one.</p> \n<p>Huh. It flies out the window just like a round thing would.</p> \n<p>Used to be that I would still be overcome by adrenaline and thinking about the fight, not waxing mathematically philosophical. When I got in fights as a kid, I would black out and not remember what happened. By the time I was sixteen, I would play a fight over and over again in my head, trying to figure out how I could’ve done better. You know, like how a guy replays a bad conversation in order to remind himself how stupid he sounded?</p> \n<p>Maybe I’m the only guy that does that thing.</p> \n<p>Nowadays, I really enjoy fighting but the high doesn’t last. Maybe all those anti-drug after school specials-</p> \n<p>This thought is interrupted by a tingly feeling in my stomach. It doesn’t last, wait, here it is again.</p> \n",
    "<p>Oh, that’s right; I stole this coat. I take a cell phone from its pocket.</p> \n<p>The phone informs me that it is ICE KRISTINE CALLING. I decide to answer.</p> \n<p>“Talk to me.”</p> \n<p>“Omigosh, I thought you were going to call.”</p> \n<p>“I wasn’t under that impression at all,” I reply. Ice Kristine has a babyish voice that some men find alluring. I read somewhere that it more than likely means that she was molested as a kid, so I’m not part of that group.</p> \n<p>“You fucking told me that you were going to call. I’ve been, like, up all night worrying.”</p> \n<p>“I really don’t think-”</p> \n<p>“Richard, is that you?”</p> \n<p>“Nope.”</p> \n<p>“Who is this?”</p> \n<p>Hmm. . . Fake name, fake name. . . “My name is Terry Lennox, ma’am, pleased to-”</p> \n<p>“Where’s Richard?”</p> \n<p>“I was kinda hoping you could tell me, ma’am.” I figure Terry Lennox is the sort of cat who would call people ma’am and sir.</p> \n<p>“What?”</p> \n<p>“You see, I think we accidentally swapped coats. I went to 24 Karat Gold with a trench coat, and he went to 24 Karat Gold with a trench coat and I guess I just checked out with his instead of mine.”</p> \n<p>“What?”</p> \n<p>“I’m dreadfully sorry. I went back to see if I could find him there, but he had left the club by then. You see I have this pair of mittens in my coat with a strong sentimental value.”</p> \n<p>“What club?”</p> \n<p>“24 Karat Gold. It’s right by the Buffalo Stamping Plant, off of route 5. Actually, maybe it is on route 5. You know how 5 kinda veers. Anyway, these mittens-”</p>",
    "</p> \n<p>“Richard wasn’t at a club.”</p> \n<p>“Well, my dear, his coat was. And his phone.”</p> \n<p>“That’s that booby bar by the McKinley Mall!”</p> \n<p>“It is about half a mile from the mall, and it is a gentleman’s club,” I clarify. “So, these mittens, they were knitted for me, or maybe crocheted, by my grandmother who suffered from rheumatism and sugar, and she-”</p> \n<p>“He told me he doesn’t go to those places. That he doesn’t believe in- ugh!”</p> \n<p>Apparently Richard might not believe in “ugh”. I, myself, remain agnostic to such a thing’s existence. “Relax, honey, maybe Richard’s coat was swapped previous to that, and somebody else wore his coat to the, um, booby bar. The guy at the place said that he kinda looked like Michael Stipe. Liked to lie back and get Mickey Mouse ears from this really endowed dancer.”</p> \n<p>“He told me that he was fighting- and I believed- how could I be so damned stupid?! Ugh!!” Ice Kristine just took Ugh’s name in vain. Sinner!</p> \n<p>“I don’t believe you’re stupid ma’am. If this Richard fella is the bald fella that I saw at the club, well then he is a charismatic and magnetic fella. He prolly just bewitched you. All the dancers seemed to like him and that lady friend he brought in with him. But I don’t wanna get the guy in trouble.”</p> \n<p>“He’s already in trouble, Mr. Lennox.”</p> \n<p>“That’s not my aim here, ma’am. Now about my mittens.”</p> \n<p>“You can pick them up in the morning. We live in Derby South. As for Richard-”</p> \n<p>“That’s great. I’ll pick them up right after church. Need some church after a night of fornication like that. I’ll bring the cell phone. As for the mittens, tell Richard ’I’m coming for ’em.’”</p> \n<p>There can’t be more than sixty houses in Derby South, but it is back whence I came. It’ll have to wait.</p> \n<p>“Feel free to, like, make a bunch of long distance calls on Richard’s phone.”</p> \n",
    "<p>She hangs up. Making calls on Richard’s phone sounds like a good idea. It takes me an embarrassingly long time to find the phone’s address book. When I do, a name near the top of the list sticks out: BSF. It has a 773 number.</p> \n<p>BSF: Blood Sucking Freaks, Chicago. Oh, I have to call this number.</p> \n<p>I go to call the number and accidentally push the button to edit it.</p> \n<p>Stupid fucking cell phone. I threaten it with a brand from the car’s cigarette lighter before it submits and does as its told.</p> \n<h3 class=\"chapter\">Chapter 7</h3> \n<p>The cell phone is ringing as I attempt to hold it between my ear and shoulder. This technique doesn’t work particularly well on such a tiny thing; there’s something the old ones did better, eh? I veer over some yellow lines in the road while attempting to catch the mobile phone, which managed to wriggle free from my head’s grasp.</p> \n<p>Maybe these things really are dangerous.</p> \n<p>I wonder if Pennsylvania has a law against using a cell phone and driving. I’m almost in Ohio and only a few places there have bans.</p> \n<p>A woman screaming out of my phone interrupts my wandering mind. “Ohmigod, Richard, I was starting to think you weren’t going to call!”</p> \n<p>Shit, I should’ve gotten into character instead of thinking about distracted driver laws. What did Richard sound like? How did he talk? Ah, nuts to it. “I got ’em,” I say in a gruff-ish whisper.</p> \n<p>“You got him? What’s wrong with your voice?”</p> \n<p>“He had me by the throat for a bit. I’m a little worse for the wear.” That sentence sounded a bit too much like Batman; I’ve got to tone it down a bit.</p> \n<p>“So, are you sending the heart?”</p> \n<p>“What heart?” Not the best response I could’ve given there. I need to relax. Plus, I kind of sounded like the Godfather.</p> \n<p>The voice on the other end freaks out a little bit. “Whaddya mean ’what heart’? The vampire’s heart! Are you driving it? Are you sending it? What the-”</p>",
    "</p> \n<p>“I meant ’what heart’. There was no fucking heart! Dude just exploded like in Blade!” I’ve just got to amp it up a bit. Play this thing harder. I can make this work.</p> \n<p>Do the kids still say dude?</p> \n<p>“Tell me exactly what happened,” she demands. I probably should’ve gotten my story straight ahead of time.</p> \n<p>Let’s improv.</p> \n<p>“So, I cornered him at this gas station. He’s buying Slim Jims and talking to the cashier. I wait for the cashier to move out the way and I emptied my uncle’s MAC-10 into him, the vampire and not the cashier. Uh, but anyway the bullets turned to steam before they could hit him.”</p> \n<p>“What?!”</p> \n<p>“Yeah! And so then he pulled me in with his eyebeams! When I was getting sucked in, I stabbed him in the chest with a bowie knife! And, I mean, he just laughed, pushed the knife all the way in and regurgitated it at the gas station attendant. It cut her head off! So, then, he grabs me by the neck and starts lifting me into the air, as vampires tend to do. Thankfully, I had my secret weapon or else I would’ve been a goner!”</p> \n<p>“What secret weapon?”</p> \n<p>“Cotton balls.” Fuck it, I’m already pretty out there. “Cotton balls soaked in holy water. I swabbed his hand with a cotton ball, and he acts like he touched a hot pot on the stove. So, then, I throw some at him, and he flies backwards over the counter. And I can tell he’s real hurt, so I shove three cotton balls in his mouth. Not two seconds later he explodes in this eerie green fire. There wasn’t a thing left, especially not no heart.”</p> \n<p>Perhaps I have amped things up a bit too much. I would guess at the eyebeams part. Perhaps I have left subtlety back in Erie, PA.</p> \n<p>“What am I supposed to tell Sloan?” She asks me this question with a mix of accusation and terror.</p> \n",
    "<p>I wonder if Sloan is a man or a woman. Avoid pronouns. “Um, tell Sloan: vampire exploded, Richard is probably on camera at a murder scene, Richard is going to hide with cousin in Elma.”</p> \n<p>“I’m not telling him that crazy story!“ Mental note: Sloan is a dude. “Who the hell is Elma? Besides, how are the cops going to know you killed the vampire if there is no body?”</p> \n<p>“The attendant. The decapitated attendant.”</p> \n<p>“The attendant can’t tell nobody if he don’t have a- oh, right. I’m an idiot.”</p> \n<p>“Listen, I’m going to lay low for like a month. Radio silence. I’m not going to call you. Ignore any calls from New York state. It’s going to be people asking too many questions, trying to shut us down. Do you understand?”</p> \n<p>“I don’t like this Richard. I’m really afraid.” Her voice is the sound of despair, and I feel like a heel. I lose the cell phone signal, and ignore the subsequent ring. A twisting in my gut confirms that I’m an asshole.</p> \n<p>A big blue sign with white letters reads, “Ohio Welcomes You to the heart of it all!” and Ohio is the color of blood.</p> \n<h3 class=\"chapter\">Chapter 8</h3> \n<p>I always convince myself that Cleveland is at the state line. It isn’t. I tell myself that it isn’t worth stopping again till after Cleveland, until after 80 and 90 join up and I don’t have to exit the interstate to stop. I can go to one of those nice rest areas with giant futuristic bathrooms and showers for the truckers. I can wash the smell of soup off my body, and buy a tacky T-shirt from a gift shop that carries far too many small unicorn “collectibles”.</p> \n<p>But driving makes me impatient.</p> \n<p>Driving makes me antsy.</p> \n<p>Driving doesn’t make me hungry, but it makes me want to eat.</p> \n<p>I end up stopping half an hour from the Pennsylvania border. It’s the middle of </p>",
    "<p class=\"noindent\">nowhere, but the gas is really cheap. I squeeze as much mid-grade unleaded as I can into the Crown Vic, while also attempting to make the total price be an integer. I overshoot by three pennies.</p> \n<p>The lights are on in a nearby fast food joint. Perhaps it is not yet closed. Opening the door successfully confirms these suspicions.</p> \n<p>I commend our nation’s insomnia.</p> \n<p>I step up to the counter. From behind a cash register, a ginger girl smiles at me even though it looks like she has been awake for the last three days. Her nametag shows the name “Ashley” or it would had it not been written in grease pen and smeared so much. As it is, it looks more like “Asniey”.</p> \n<p>I would like some of those dollar chicken sandwiches, so I say to Asniey, “I would like some of those dollar chicken sandwiches.”</p> \n<p>Her smile gets stronger on the left side, but remains the same on the right. She replies, “How many is some?”</p> \n<p>“More than a couple, yet less than a lot.”</p> \n<p>“I’m going to put that in as three.”</p> \n<p>“No, three would be a few. I would like some.”</p> \n<p>“All right.” She furrows her brow and says the next thing with the slow determination of a movie cowboy, ”Four.”</p> \n<p>“That sounds great.”</p> \n<p>“All these years, who knew that some meant four?”</p> \n<p>“I thought it was obvious.”</p> \n<p>“And a few was three?”</p> \n<p>“I know. I just blew your mind.”</p> \n<p>“So I guess that six would be two fews, but ironically six is rarely too few.”</p> \n<p>At this point, I’m not sure if she was joking or presenting me with weird mushroom- based logic. But it is diverting enough to make me forget what an asshole I am, and stop worrying if Sloan is going to kill that disembodied voice from the video store.</p>",
    "</p> \n<p>I can smell that Asniey is menstruating; I probably shouldn’t tell her that.</p> \n<p>The restaurant appears to be a two-person operation at this time of night. Asniey is working the counter and the drive-thru, and a tall black-haired fella seems to be making all the food. Asniey tells me that chicken has to be dropped into the fryer for my sandwiches and that it will take six minutes, as though that were an inordinate amount of time. She tries to sell me a pop, and I am tempted to fall into a Bela Lugosi cadence when I tell her “I don’t drink pop.”</p> \n<p>Eventually, my sandwiches are all piled onto a brown plastic tray, and I take them to a small table against a wall. The table has two attached chairs, evocative of barstools. The seats look as though they should swivel, but sadly do not.</p> \n<p>Even swivel-less I enjoy being able to sit down, eat, and not have anybody try to stab me. It’s the little things that make un-life worth un-living.</p> \n<p>The first sandwich tastes three-hours old, while the second one is astonishingly hot. Just the same, I manage to get an equal amount of mayonnaise on my shirt with each. As I unwrap the third sandwich, I notice six teenagers come through the door. They all appear to have arrived in the same modestly sized car, and a quick study leads me to the conclusion that none are armed with anything heavier than a wallet chain. They give the impression of people who just came from a late-running concert far from home, and not a team of vampire killers.</p> \n<p>I’m also fairly certain that I have never heard of whatever band they just saw.</p> \n<p>Four of them start madly pushing buttons on their respective telephones while waiting in line, and they don’t stop this thing even when ordering their food.</p> \n<p>A large, old man wearing a Browns cap enters the restaurant and becomes instantly irate at the number of people at the counter. He steps in and out of the queue and begins yelling, “can’t we open up another line?!” to nobody in particular. For every fifteen seconds that he is kept waiting, he shouts a frustrated phrase: “This is ridiculous!” and “I’ve got to be some place in twenty-five minutes!” or the always appreciated “C’mon!”</p> \n",
    "<p>By the time the old man makes it to the counter, he is making these odd sighing sounds that are reminiscent of the noises bulls make in cartoons. Asniey delivers the politest, “what can I get for you today, sir?” that I have ever heard. The old man in the Browns cap pauses, looks at the menu over her head, and asks, “Do you have any specials or anything?”</p> \n<p>The amount of time it takes him to order feels like a lot more than six minutes, and I hate him. I hate this old man. Old. Huh. He’s probably my age.</p> \n<p>I finish up my last bite of chicken and head towards the bathroom. It is surprisingly clean and smells like bubblegum shampoo. I take off Richard’s old coat to examine the dent Richard’s old bullet made in my forearm. The coat sleeve pulls inside out, its lining sticking to my dent. I rip the lining off like a band-aid. The skin in the dent is fresh and sticky, but the same color as the rest of my flesh. Apparently, that is also the color of my blood now.</p> \n<p>I rinse some lint out of the pit in my forearm. I wash my face, and note that every day it feels more like a latex mask. My skin has become slowly replaced by something that is not skin, an approximation of skin.</p> \n<p>The old wives tale says your hair keeps growing after you die. It doesn’t really; it’s a trick of decay.</p> \n<p>My hair stopped growing twenty years ago.</p> \n<p>I turn a hand-dryer upside down to blow the hot air on my face. The cylinder is full of blue and green mold, and smells of it.</p> \n<p>Exiting the bathroom, I pass the old man in the Browns cap. Apparently, he is no longer in a hurry.</p> \n<p>I get in line once again. Asniey glances at me and says, “I knew you’d be back.”</p> \n<p>“Why yes ma’am. It has come to my attention that I need an ice cream cone. Is that one of the many fine services you provide at this dazzling establishment?”</p> \n<p>She says, “I think we can hook you up.” I hold out a five dollar bill, which she </p>",
    "<p class=\"noindent\">snatches and quickly replaces with a pile of smaller moneys. I pocket my change, and Asniey grabs a cone with a tiny paper sleeve on it.</p> \n<p>I decide to start a conversation. “So, that guy was a jerk, huh?”</p> \n<p>“Oh him? He comes in all the time, in his little Suzuki Samurai. Orders a hamburger, only ketchup, and a senior coffee.”</p> \n<p>“He gets the same thing every time and has to think about it?”</p> \n<p>“Usually.”</p> \n<p>“You know, if I were to punch him in the eyebrow with a downward force, I could make him bleed all over the place. It doesn’t do a lot of permanent damage, but it makes one hell of a scene. Of course, if you wanted some permanent damage, I have been known to break arms.”</p> \n<p>“No, thank you.” She hands me the ice cream cone. The swirls have a beautiful sort of symmetry to them. “I think it’s creepy to even joke about these things. Violence is always unfortunate.”</p> \n<p>I emit a noise designed to keep her talking, a thing she would like to do.</p> \n<p>“Whether or not you were kidding, I understand that you are coming from a place of compassion in your, um, offer. But in either case, aggression is not compassion. Anger isn’t happiness. Pain isn’t love. Hate isn’t love.”</p> \n<p>“You’re not a cult leader, are you, hon?”</p> \n<p>“Nope. Not even spiritual.” She says the last word with disdain. “Bigger atheist than Richard Dawkins, actually.”</p> \n<p>I didn’t even know the guy from <i>Hogan’s Heroes</i> was an atheist. I tell Asniey, “thank you for the ice cream and the company,” as sincerely as I know how.</p> \n<p>She responds with, “have a good one,” or some such preprogrammed send-off that develops from saying goodbye thousands of times a week.</p> \n<p>I finish the cone in the parking lot, accidentally eating the paper sleeve with it.</p> \n<p>Considering the lot is all but empty, a Suzuki Samurai is parked way too close to the Crown Vic. I have to walk semi-sideways to get to the driver-side door. Even then I can’t open it significantly without hitting the Samurai.</p>",
    "</p> \n<p>I notice that the Suzuki’s undercarriage is still a little warm as I reach underneath its passenger side running board. With a movement similar to caber tossing, I’m able to flip the tiny car onto its vinyl roof. The car slides a bit on the ice and reminds me of a helpless turtle. Good news for the old man: his roll bar works.</p> \n<p>There is now plenty of room to get into the Crown Vic.</p> \n<p>Aggression might not be compassion, but you can’t argue with results.</p> \n<h3 class=\"chapter\">Chapter 9</h3> \n<p>**BEEP**</p> \n<p>Richard’s cell phone is dying and it has decided to whine about it. It beeps every fifteen seconds in what I figure to be a misguided effort to conserve energy.</p> \n<p>I drive aimlessly around Strongsville, Ohio trying to remember the address of a half-Tuscarora dominatrix. She caters to many an odd fetish, all the way down to selling half-pints of her “personal” blood in small Tupperware containers for fifty bucks a pop.</p> \n<p>**BEEP**</p> \n<p>You get to keep the Tupperware.</p> \n<p>I’m somewhere near Medina when I decide to call the whole thing a wash. I track down the 80 Westbound, knowing full well I’m not going to make it to Chicago by the morning.</p> \n<p>**BEEP**</p> \n<p>I shut the phone in the glove box.</p> \n<p>Eventually, 80 becomes 80/90 and all too soon after that I stop at one of those faceless rest areas you find on toll roads. These things come in pairs, with one on the westbound side of the interstate and the other on the eastbound, identical twins separated by speeding vehicles.</p> \n<p>As if it weren’t hard enough to distinguish one thing from another in Ohio.</p> \n<p>Sadly, this isn’t one of the massive stops with its own Burger King and Sbarro. It claims to have a Cinnabon, but really it just has a convenience store that can microwave sticky buns.</p>",
    "</p> \n<p>I buy a pair of cheap sunglasses and the first dark t-shirt I can find that doesn’t have anything about Ohio written on it.</p> \n<p>I hate Ohio.</p> \n<p>I change shirts and clean up as best I can among a slew of urinals that has each earned its own cubicle. Stepping out of the bathroom reveals a number of prize-machines. I pay a dollar and manage to win neither a stuffed fish nor an *NSYNC keychain.</p> \n<p>Somehow I still feel like a winner.</p> \n<p>The sun is going to be up soon. I park the Crown Vic in what I presume will be a shady corner of the lot and pop the trunk. I grab the backpack and take off my coat, using the two as a pillow and blanket, respectively, for my makeshift bed.</p> \n<p>There are worse spots to sleep than the trunk of a 2000 Crown Victoria. It’s roomy, as these things go. It’s carpeted. The spare tire provides a pleasant rubber smell. Thankfully, this year has one of those release levers that will open the decklid from the inside. I don’t know if winter in Ohio is exactly the best setting for such a nap, but temperature hasn’t strongly affected me for some time.</p> \n<p>I’m out for about two hours before I hear it again.</p> \n<p>**BEEP**</p> \n<p>The beast has somehow escaped the glove box to disrupt my slumber. The cunning bitch!</p> \n<p>**BEEP**</p> \n<p>I will kill it in the face with righteous death!</p> \n<p>**BEEP**</p> \n<p>The noise seems to be coming from my pillow. The bag is beeping. Usually not a good sign.</p> \n<p>**BEEP**</p> \n<p>It is pitch black and I’m in a trunk trying to work a thousand zippers leading to a thousand pockets.</p> \n",
    "<p>**BEEP**</p> \n<p>I am the poor man’s Houdini.</p> \n<p>**BEEP**</p> \n<p>I track the source down to what seems to be another cell phone, but bigger.</p> \n<p>**BEEP**</p> \n<p>I pull the release latch in order to open the trunk enough to get some light in here. Why would Hugh have a second cell phone? Is this even a cell phone?</p> \n<p>**BEEP**</p> \n<p>The trunk is frozen shut. Fuck.</p> \n<p>**BE- -**</p> \n<p>I wonder if that was a cell phone. It smashes apart just like one. That, and thawing open the trunk can wait till tonight. I need to rest.</p> \n<h3 class=\"chapter\">Chapter 10</h3> \n<p>As I previously stated, a car trunk isn’t a terrible place to sleep. It helps to think of it as being wrapped in the safety of a big metal blanket and not as being trapped in some poorly designed coffin. I spend half the day resting semi-comfortably and the other half contemplating the annoying thing I smashed.</p> \n<p>Sleeping on a scissor jack tends to make me all “exposition-y” so I offer my apologies in advance.</p> \n<p>The annoying thing was too big to be a modern cell phone and the battery lasted too long to be an old one. As I think of one hundred things it couldn’t have been, one question keeps rearing its stupid ugly head: did Hugh LoJack his book bag?</p> \n<p>Asshole.</p> \n<p>Most tracking chips are passive things. A biologist puts a tag in the belly of a sturgeon so he can see if he catches that same fish next year. You have an I-Zoom, you go through a toll booth, a scanner reads your chip and money is taken out of your account. These things don’t send out signals; they get read.</p> \n",
    "<p>Active trackers are something you see more out of the likes of Spider-Man or Batman. A Spider-Tracer isn’t practical in real life because anything small enough to be put on a bad guy without them noticing is also too small to have any battery worth a damn.</p> \n<p>I suppose exposition-y isn’t a real word. Maybe expository was what I was looking for earlier. Nah, sounds too much like suppository.</p> \n<p>Now, the only reason LoJacking a car works is that a car has it’s own massive power supply. At the very least, for an active tracking device to be at all useful you would probably have a battery. . . somewhat larger than a cell phone battery.</p> \n<p>Fuck. That could explain how Richard found me. Of course, it doesn’t explain how Hugh did. I’ll worry about that one later.</p> \n<p>Fuck it. The annoying thing is busted, and no one is trying to kill me at the moment. Therefore, it doesn’t matter if it was an I-Zoom or a <i>Star Trek</i> phaser gun.</p> \n<p>So, fuck it.</p> \n<p>When it is time to wake up, I am feeling less patient than usual. Eschewing any sort of finesse, I decide to simply kick open the frozen decklid and rely on the power of mini bungee cords to compel the bastard shut. I gas up the Crown Vic (mid-grade) and hit the interstate. The sound of the semi-open trunk makes an almost pleasant noise, like a harmonica made out of wax paper on a comb.</p> \n<p>I vow not to stop at all in Indiana. I need to keep moving. I need to stop being a passive part in all this nonsense. I need to start taking the fight to them. (These little speeches I give myself tend not to have a lasting effect.)</p> \n<p>Plus, I hate Indiana.</p> \n<p>I scan the radio stations, looking for some music that doesn’t make me want to pluck out my ear drums. “Seasons in the Sun” tag teams with “Waterloo” and makes me kill the radio. I do nothing but drive, listen to the humming of the bungee, and stare for the next few hours.</p> \n<p>I’m cut off four times, causing me to compile a list of car makes and models </p>",
    "<p class=\"noindent\">upon which I will have my revenge. Those of you driving Chevy Cobalts, consider yourselves warned.</p> \n<p>What’s interesting is when you go to New York, you get a sign that reads, “Welcome to New York,” or something like it. Signs boldly declare, “Pennsylvania Welcomes You.”</p> \n<p>“Welcome to Indiana, Crossroads of America, Lincoln’s Boyhood Home.”</p> \n<p>If you take 90 west into Illinois, the state chooses not to welcome you. Instead you get, “Welcome to Chicago, Richard M. Daley Mayor.” Implied in that sign is, “Who gives a good goddamn about the rest of Illinois?” and the “for Life” after Daley’s title of Mayor.</p> \n<p>Also interesting is Chicago’s choice to welcome me with two punitive tolls right after I just finished paying Indiana’s.</p> \n<p>Chicago. I’m in the city already. I could drive for an hour and still be in this city. Chicago has about two hundred and thirty square miles worth of land. That’s as much as Buffalo, Boston, Pittsburgh, and Cleveland combined.</p> \n<p>Maybe the word I was looking for was explicatory. I get all explicatory after sleeping in a trunk. Nah, that sounds weird.</p> \n<p>Sadly, being in Chicago means that it is time to say goodbye to my friend Victoria comma Crown. The ideal place to leave a stolen car is an airport parking lot. There are planes, trains, cabs and buses to take you just about anywhere in the world. I mean, compare that to a Target parking lot. Ditch a car there and your options are to walk home, call a cab, steal another car, or hang out at Target.</p> \n<p>Then again, I don’t feel like driving to Cicero Avenue and I definitely don’t want to go all the way to Des Plaines. Next to an airport, the best place to leave stolen cars would be in a spot where it is likely to be re-stolen. Luckily, I could really go for a bone-in pork chop sandwich.</p> \n<p>I exit on Roosevelt and leave the Crown Vic running next to the eastbound on-ramp. I take everything I need from the car and buy two hotdogs and a pork chop </p>",
    "<p class=\"noindent\">sandwich from Jim’s Original. Fifteen seconds and $8.25 later, I’m chewing through the bone of a dead pig and making my way to Hyde Park on foot. Walking the lakefront most of the way, it takes me just under two hours. The food doesn’t last nearly so long.</p> \n<p>If you are trying to break into an apartment building at four in the morning, dogs with small bladders can make your life a heck of a lot easier. In a college neighborhood apartment turnover is quite high. Residents tend not to know all the people in their buildings. A sleepy-eyed man in a bathrobe, who has propped his vestibule doors open with abandoned newspapers while he waits for a Weimaraner to pee, isn’t likely to question the strange man casually meandering into his six-flat.</p> \n<p>Blathering. Maybe blathering is what I do after sleeping in a frozen goddamn trunk in fucking Ohio.</p> \n<p>I spend 90 seconds fiddling with a bobby pin in the door of apartment four before noticing it is unlocked. Sometimes life is swell. I manage to find a Robert Mitchum movie on an overly complicated television. Being pro-active can wait; I finish the movie and find a nice closet in which to sleep.</p> \n<p>I wake up a few hours later to hear a woman screaming. She has thrown a pair of shoes on top of me and is clutching her chest.</p> \n<p>She looks at me and shakes her head. “Ambrose, Jesus Christ, you scared the shit out of me. You could have just slept on the bed, ya know?”</p> \n<h3 class=\"chapter\">Chapter 11</h3> \n<p>Sheila is the color of coffee ice cream. She’s small with soft, pleasant features. I probably stop by and see her every other year, which probably makes her my closest living friend. Although, she does think my name is Ambrose Chapel.</p> \n<p>“You’re lucky I still live here, Ambrose. What if I had moved?”</p> \n<p>“I knew you were still around; I saw the picture of Nancy-” I pick up this thing as I name it.</p> \n<p>“Ooh. You know, I had to put Nancy down nine months ago. She kept getting </p>",
    "<p class=\"noindent\">those grand mal’s seizures. I gave her the medicine, but it started to eat up at her liver. It was really sad.”</p> \n<p>“Shame. She was a good puppy.”</p> \n<p>“She was fourteen years old, Ambrose.”</p> \n<p>“S’at right?” This year still seems like the far future to me. I guess a part of me expected us to stop counting after 1999. “Anyway, between the picture of Nancy and your weird coconut incense bottle, I was pretty sure you were still living here.”</p> \n<p>“Shut up. It’s not incense; my grandmother gave that to me.”</p> \n<p>I set the picture down, not seeing those sentences as being as closely related as she had said them.</p> \n<p>“Well, whatever that is.”</p> \n<p>“It is sacred oil,” she corrects. “It bubbles when aswang is around.”</p> \n<p>I ask “who is ass wang?” before realizing I don’t care about the answer.</p> \n<p>“The aswang is a vampire.”</p> \n<p>A pause. A sideways glance. Okay, maybe I should’ve cared about that answer.</p> \n<p>Despite my silence, Sheila advises me to “Shut up.” She clarifies, “It is a real vampire, you know? Not like you. They attack pregnant ladies and kids and stuff, and they eat the dead and make fake corpses out of banana plants”</p> \n<p>My eyebrows collide in confusion. ”Why would they make and eat the- wait, I’m real!”</p> \n<p>“No. You are not aswang. You are like a transhuman who drinks the blood.”</p> \n<p>I stop myself both from debating supernatural taxonomy and making a joke about Dr. Frank-N-Furter. I’m amazed by my self-control sometimes.</p> \n<p>Sheila goes on to explain to me that my current state is the result of me rejecting the notion of biology as destiny and how true freedom is the freedom over one’s own flesh. She talks about stuff she’s read regarding robot bodies, virtual immortality, exoskeletons for the lame, cybernetic implants, and the future problems of </p>",
    "<p class=\"noindent\">the diminishing distinction between human and nonhuman. She talks about the Roomba for a solid six minutes.</p> \n<p>I can’t remember the last time anybody spoke to me for so long. It’s both pleasant and uncomfortable. She winds herself down after a spell, somehow coming around to her initial talking point. She declares, “We are who we choose to be. We should be able to choose to be whoever the fuck we want, even if we have to get rid of some of the original materials.”</p> \n<p>I didn’t see anything wrong with that notion.</p> \n<p>Sheila convinces me to sleep in her bed, when my first instinct is to sleep underneath it. I’m drifting off when she crawls in next to me, rests her head on my chest, and falls asleep way before I do.</p> \n<p>She coos some and her nose makes a sound like a zipper.</p> \n<p>I wake to the sound of a shutting door. It is already five pm, and I’m alone in the bed. I sit up as Sheila walks into the bedroom and announces that she has something for me. She tosses what looks like the world’s largest juice pouch onto my lap.</p> \n<p>“Is this-”</p> \n<p>“It’s a blood bag. It’s like a third of a liter or something.”</p> \n<p>The question “how?” escapes my lips somewhat involuntarily.</p> \n<p>“My cousin works at the blood place. She gets to throw out the blood that has syphilis and stuff.”</p> \n<p>“So, you just threw a bag of syphilis at me.”</p> \n<p>“Oh. Is that bad?”</p> \n<p>“Not if you got a straw that’ll poke through it. I’m going to treat this like a giant Capri Sun.”</p> \n<p>“Shut up.”</p> \n<p>Sheila is quite fond of that phrase.</p> \n<p>“So, what’d you tell your cousin to get the blood?”</p> \n",
    "<p>“That it was for the vampire.”</p> \n<p>Straightforward. “But I thought I wasn’t-”</p> \n<p>“You know what I mean. Anyways, she wanted me to ask you for a sample of your blood.”</p> \n<p>“Yeah, I’ll get right on that.”</p> \n<p>Sheila asks me what the plan is, and I dig out the business card:</p> \n<p>BLOODSUCKING FREAKS</p> \n<p>Videos, Novelties, Swank.</p> \n<p>She studies one side, flips it over, finds it blank, and flips it over again, “That’s weird.”</p> \n<p>“What?”</p> \n<p>Sheila explains, “Well, its address is on 52nd street. Businesses and restaurants and stuff aren’t on even numbered streets.”</p> \n<p>I tell her I think it is weird a video store is trying to murder me and harvest my organs. I explain the important parts of that whole situation.</p> \n<p>“It’s only like five minutes away, if you want me to drive you there. Parking’s hard, though.” She takes a minute to consider the situation. “And, you know, they want to kill you.”</p> \n<p>I spent so much time thinking about getting to Chicago and Bloodsucking Freaks and now that I’m here I have no idea what to do next. Maybe I should do some surveillance. I suppose I could walk right into the lion’s den, consequences be damned, and start smashing things and terrifying the minimum wagers. Even if they are expecting me, it is wintertime and I could wear a parka and a ski mask. That would buy me a little bit of time if the staff knows what I look like.</p> \n<p>I study this thing from multiple angles. I make my decision, “I think I’ll take that ride. Do you mind making a few stops beforehand?”</p>",
    " \n<h3 class=\"chapter\">Chapter 12</h3> \n<p>“Do we need guns?” Sheila asks me this question with discernible and terrifying excitement; I’m most concerned about the “we” part.</p> \n<p>“A gun would be nice, but can’t easily get one here. Laws and all that.” Chicago has all sorts of laws to protect its citizens from handguns, spray paint, and putting potted plants on window sills. Naturally, that’s why you never see any shootings, graffiti, or flowers in this city.</p> \n<p>Sheila protests, “No, but there is Hyde Park Arms, right over by your blood-sucking friends’ store!”</p> \n<p>I explain to her that Hyde Park Arms is not an armory, but rather a transient hotel. She explains to me that that is a stupid name for a hotel.</p> \n<p>Come to think of it, I probably could find a pistol or two there. Instead, she drives us to a nearby strip mall.</p> \n<p>At first the hardware store looks promising; it doesn’t end up panning out. I had been hoping to cobble together some sort of flash bang or smoke bomb or some sort of clever-distracting-boom-making apparatus. Were this closer to the fourth of July, at least I could improvise something made out of fireworks. You can even make a nasty little explosive device out of five dozen sparklers and electrical tape. Don’t try that at home, kids.</p> \n<p>Of course, all that shit is probably illegal here anyway.</p> \n<p>I stare at a pry bar for a solid ninety seconds, eventually dismissing it as too large to hide. With wild eyes, Sheila shows me a pink dog blanket with sleeves, and I can’t tell if she thinks it simply wonderful or utterly ridiculous. I end up spending too much money on a large package of zip ties: the thinking man’s duct tape. Out of respect for Sheila, I don’t mercilessly flirt with the cashier.</p> \n<p>We half-walk half-ice skate across the parking lot towards Walgreens. Then again, try to walk anywhere in Chicago that can’t be described as “towards </p>",
    "<p class=\"noindent\">Walgreens”. There are about three Walgreens for every square mile of this city. I would compare them to a lice infestation if they weren’t so damned useful. They are open all the goddamn time and sell everything from baby food to Sonny Chiba movies. They even have my zip ties for half of what I just paid. Damnit.</p> \n<p>Being in Hyde Park, this Walgreens seems to specialize in Obama tchotchke – T-shirts, key chains, and Presidential Chia pets. Sadly I did not see a Barack Obama Snuggie.</p> \n<p>I grab a pair of shower sandals, a black sharpie, and the biggest manila envelope I can find. I’m stuck in line behind a college-aged couple buying Swisher Sweets. At least, I assume they are a couple. They look like two of the same person with a slight difference in gender. Both have greasy, shoulder length hair, both are wearing thick-rimmed glasses, and both are wearing jeans that Jack Pumpkinhead couldn’t fit his legs through. Seriously, do these kids have detachable feet? How do they get into these pants and why? Is the young generation pleasuring themselves to pictures of skinny ankles?</p> \n<p>So many questions.</p> \n<p>When it is my turn, the clerk spends two minutes leafing through a Walgreens ad in order to find a coupon to save me thirty cents on my envelope, then advises me to have a blessed day.</p> \n<p>I tell her I’ll do my best.</p> \n<p>Tiny snowflakes hang in the air as we step outside. I start to assemble my pieces right then and there when Sheila informs me that it is winter and that she comes from a tropical climate. I finish my project on the dashboard of her car.</p> \n<p>Sheila was right. The address of the video store isn’t in what I’d call a commercial section. The place itself looks to be poking up from the basement of an apartment complex, as though the weight of the building has caused the first floor to be sunken half a level. The only other business around is a similarly bottom-dwelling store specializing in pop cans and tiny bags of chips.</p> \n",
    "<p>I tell Sheila to keep the motor running, in case things go south.</p> \n<p>“That’s bad for the Earth,” she tells me, stoically. She adds, with enthusiasm, “And what if I get bored?”</p> \n<p>A pause.</p> \n<p>“And what if they have to plow the snow?”</p> \n<p>“If they plow, go around the block. The Earth will be fine this one time. If you’re bored, go rifle through the things in my backpack. I left it on the back seat.”</p> \n<p>She flops the top half of her body over the center console, grabs the backpack, and returns to a seated position while simultaneously dropping the bag on her lap.</p> \n<p>“I’ll be right back,” I tell her.</p> \n<p>“Why does this bag smell like soup?”</p> \n<h3 class=\"chapter\">Chapter 13</h3> \n<p>“Wait,” Sheila yells. “Can you pick me up some cortizone if they have any?”</p> \n<p>“Why would a video store have cortizone?” It seems like a reasonable question for me to ask.</p> \n<p>“The hardware store sold Snuggies.” This statement is true and provides a compelling argument. She adds, “C’mon. I am itchy. I think I have spider-bites.”</p> \n<p>“Maybe you have bedbugs.”</p> \n<p>“Why?” she shouts, eyes growing wide. “Are you itchy?”</p> \n<p>“No. Bugs don’t bite me.”</p> \n<p>“Really? Why not?”</p> \n<p>I adjust the sleeve of my coat and suddenly remember that I stole this coat. From Richard. The Vampire Hunter. With this store on his speed dial.</p> \n<p>I am too fucking stupid to live.</p> \n<p>“Sheila, I’m going to fulfill some destiny over here. I’ll get you some itch cream if they have some. Okay?”</p> \n",
    "<p>Alarms are going to go off as soon as I step foot into this place.</p> \n<p>“Okay.” Sheila slumps down in the driver’s seat of the idling car, leafing through the pages of squiggles.</p> \n<p>Coats are mass produced. Richard lived 500 miles away. There might have never been a face-to-face meeting between Richard and these people. Relax.</p> \n<p>These are the things I tell myself to stop my viscera from twisting like a taffy pull.</p> \n<p>Ah well. I’ve come this far.</p> \n<p>I walk down to Bloodsucking Freaks. There is a Christmas bell strung to the door. Metal slaps glass and jingles as the door slams behind me, and I start to think this place might not have the crack security I was expecting. I scan for cameras, looking past a sea of oddities: statues of big headed girls in slutty outfits, Japanese movies in thick black VHS cases, comics with random streams of words for their titles. Seriously, does anybody know what an <i>All Purpose Cultural Cat Girl Nuku Nuku</i> might be?</p> \n<p>I guess I was expecting a lot more Lon Chaney Jr. stuff.</p> \n<p>On the far right corner rests a lone security camera. It’s got to be from the eighties.</p> \n<p>I put on my friendliest face, brandish my manila folder, and walk towards the small, dark-haired man behind the cash register. His smile is broad; his greeting and eyes are empty.</p> \n<p>I force my stomach to relax as I start talking. “Hi, my name is Max Thaler. I found this package on my stoop. It’s from something called Scantech Industries and it says it is for somebody named Sloan. The UPS guy or whoever musta screwed up. You see, I live at 1476 West 52nd Street, and the address on the envelope is 1476 <i>East</i> 52nd Street.”</p> \n<p>The man stares blankly.</p> \n<p>“Which is here,” I add.</p> \n<p>No change.</p> \n",
    "<p>“At this store,” I clarify.</p> \n<p>The man continues to stare blankly.</p> \n<p>“By any chance, are you Sloan?”</p> \n<p>“No. I am Ivan.”</p> \n<p>This plan had so much promise, flip-flops for information. It was a thing of beauty. Yet now I want to smash this shop into tiny Japanese pieces. I begin saying things more slowly. “Do you know who Sloan is, or where I might find this person?”</p> \n<p>“You are Sloan?” Ivan asks me without any trace of facetiousness.</p> \n<p>A moment for composure’s sake.</p> \n<p>“No. I’m Max. I am looking for Sloan-”</p> \n<p>Silence.</p> \n<p>“-whose package I have-”</p> \n<p>Silence.</p> \n<p>“-and it was supposed to go here.”</p> \n<p>Ivan’s face mixes irritation and confusion. “Maybe I should see if there is somebody who is named Sloan who is working here-”</p> \n<p>“That would be super,” I say with a tremendous amount of enthusiasm. At this point even I’m not sure if I’m being disingenuous.</p> \n<p>“-but I do not know how to do that,” Ivan finishes his thought, adding, “I’m new.”</p> \n<p>I could kill this man, drain him of blood, tie his corpse to a cinderblock and throw it into the MSI lagoon.</p> \n<p>We will call that plan B.</p> \n<p>“Ivan, my friend, is there anybody else working here tonight.”</p> \n<p>“Kate works here. But does not work tonight. I could check if she works tomorrow. I don’t know where to check.” Ivan pauses between each of these statements in order to, I presume, increase my suffering.</p> \n<p>“Excuse me,” Ivan motions behind me as he says this thing. “Yes?”</p> \n",
    "<p>A pasty girl with uncontrolled hair standing to the rear of my right shoulder addresses Ivan,” Do you have any copies of <u>I Walked with a Vampire</u>?”</p> \n<p>“It comes out tomorrow,” he tells her.</p> \n<p>“I thought it came out at midnight tonight?” She says this thing in a manner that really only earns half a question mark.</p> \n<p>“It comes out tomorrow,” he repeats to her.</p> \n<p>“But midnight tonight is tomorrow.”</p> \n<p>“No, that’s tonight. It comes out tomorrow.”</p> \n<p>“Ivan,” I say, “when is your day off?”</p> \n<p>“Tomorrow.” He flips something over in his mind for a moment and adds, “but not midnight tonight.”</p> \n<p>The girl continues to argue with Ivan, and I head back to Sheila’s car. I’m not dealing with that anymore; it can wait till tomorrow.</p> \n<p>“How did it go?” Sheila asks, as I slam the car door shut.</p> \n<p>“Not as much fun as being shot. You mind if I crash at your place another day?”</p> \n<p>“No. But you must rub my toes.”</p> \n<p>“Sounds fair.”</p> \n<p>Sheila puts her car into drive and carefully maneuvers down the snow-covered road. She turns on the radio and asks, “So, why do you have all those notes?”</p> \n<p>She turns up the radio, apparently approving its dance pop.</p> \n<p>“Notes?” I ask.</p> \n<p>“Yeah,” she yells. “All those pages of shorthand from your backpack.”</p> \n<h3 class=\"chapter\">Chapter 14</h3> \n<p>“Shorthand?” I say the word with a fair amount of incredulousness, and turn down the car’s radio.</p> \n<p>“Yeah. It is shorthand. It is not the kind that is popular in America.” Sheila </p>",
    "<p class=\"noindent\">adjusts a vent to blow hot air on her right hand. “They use this one more in, like, Europe. My aunt used to teach a class for secretaries. I can’t read it, but I recognize the letters.”</p> \n<p>In life, I find that I am easily overcome by feelings of minor hopelessness. I’m the sort of person who, in the back of his mind, feels that a bus is actually never going to come after waiting for only a few minutes. Sheila has just struck me dumb by pointing me to the solution of a mystery I had dismissed as unsolvable. While it messes up my worldview, it does so to my betterment.</p> \n<p>Finally, I utter, “You mind going to Kinko’s and faxing these to your Aunt?”</p> \n<p>Sheila informs me that a.) Kinko’s has been FedEx for a long time now, and b.) faxing is last century technology. She says she can scan and email them from her house, and we go to do that thing. Sheila turns the radio back up and sings along with some song I don’t recognize. It might be about robots.</p> \n<p>Soon, we are back on Sheila’s street. This woman has a terrifying way of parallel parking in the snow. She guns the motor, cranks the wheel and power slides till the rubber bounces off the curb. It makes me glad to be undead.</p> \n<p>As we step out of the car and head towards the six flat, I hear Sheila mutter, “That’s weird.”</p> \n<p>A mental flag goes up.</p> \n<p>“What’s weird, hon?”</p> \n<p>“I always leave the light on in the Florida room.”</p> \n<p>I look up at her window. The place is dark.</p> \n<p>Could be the light burned out.</p> \n<p>It’s possible.</p> \n<p>It’s likely, even.</p> \n<p>“Sheila, why don’t you go scan and email that from Kink-FedEx, just in case something is wrong up there. There’s still one on 57th Street, right?”</p> \n<p>“Yeah.”</p> \n",
    "<p>“Why don’t I meet you there in about an hour or so. I’ll try to call you if it takes longer than that.”</p> \n<p>“You think it-”</p> \n<p>“Just in case, okay?”</p> \n<p>“All right. It is not going to take me an hour to email this. So, I will be in the bakery just down the block. They have cinnamon rolls.” Sheila hands me her keys and explains what each one unlocks. The ring has one of those red plastic key chains with a slot into which you can slide a little piece of paper. The paper is long gone. She keeps a key ring with a big, rubbery Ford oval, and heads back to her car.</p> \n<p>Sheila’s method of leaving her parking space isn’t any less scary, but it is a lot more smoky.</p> \n<p>I make my way through the vestibule and up the stairs, making a fair amount of noise. I jingle the keys before I put them in the deadbolt, looking under the door for moving shadows.</p> \n<p>Inconclusive.</p> \n<p>I put the key in the knob lock and turn the handle, deliberately. I hold the knob, keeping in turned, put my right foot underneath it, and push the door open as violently as possible.</p> \n<p>It hits something that starts to curse and bleed.</p> \n<p>In the threshold of the bedroom, a woman in her early twenties stands, mouth agape, pointing a water pistol at me. I disarm her with an outer-crescent kick. Despite what you see on movies and TV, an outer-crescent kick is an impractical offensive move. But it does works well to disarm slack-jawed girls.</p> \n<p>Though, I’m not really sure why I bothered to disarm her.</p> \n<p>. . . I guess it’s kind of cold to go outside with wet hair.</p> \n<p>The cursing, bleeding thing charges me and I recognize it as a man, maybe forty years old. I sidestep his charge, and deliver a low side kick just below his kneecap when he stops to change direction. As he goes down, I knee his face.</p> \n",
    "<p>His orbital breaks. His face is already starting to swell.</p> \n<p>I turn on the lights, as a large crucifix hits the door behind me. A metal Jesus falls off a wooden cross. The girl has come back to her senses, in a manner of speaking, and is running straight for me.</p> \n<p>I grab her around the neck and beneath her right armpit, clasping my hands behind her. Her head and arm are trapped, and I shift my hip behind hers and take her to the floor.</p> \n<p>“From this position,” I say, “depending on how you wiggle, you will lose consciousness from either a lack of air or a lack of blood flow to the brain.”</p> \n<p>She squirms, trying to elbow the back of my head. She isn’t in a position to get much force behind her blows.</p> \n<p>“The smart money is on the blood.”</p> \n<p>She tries to punch me across her own body using her free arm. It barely connects.</p> \n<p>“I’m sorry to choke you like this. I feel like it is my only option. Maybe it’s just my generation, but I don’t think a man should strike any woman he’s not already married to.”</p> \n<p>She flails desperately, and some of her hair gets into my mouth. She reaches into a pocket in her pants and, with considerable effort, removes a shiny, metal stake.</p> \n<p>She thrashes with the stake and manages to rip the back of my coat.</p> \n<p>I pull some of her hair off my tongue right after she passes out. Still sitting on the floor, I notice another man in the room. He has sandy hair and can’t possibly be out of his teens. He attempts to walk past me on tiptoes.</p> \n<p>I cover his right foot with my left hand and push the inside of his right ankle with my right hand. He tumbles gracelessly.</p> \n<p>The teen covers his face and yells, “I’m not with them. Can I go?”</p> \n<p>This is a new one for me.</p> \n<p>“What do you mean, you’re not with them?”</p> \n",
    "<p>The boy explains. “My name is Stuart Jordan. I was just going to write a story on this guy for the Maroon. The school paper. He’s this crazy neighborhood vampire hunter. He calls himself Hawthorne. Says somebody paid him to track you years ago.”</p> \n<p>“This your girlfriend?”</p> \n<p>“No, sir. The girl is named Marguerite. She’s like his ward or sidekick or gal Friday. Please, can I just go. I really want to leave.”</p> \n<p>Oh, well he <i>really</i> wants to leave. “What do you know about this store, Blood Sucking Freaks?” I am happily surprised to find that I left the zip ties in my coat pocket. I use them to bind the wrists of the bleeding man and squirt-gun girl. I prop each into a seated position against the wall.</p> \n<p>“I don’t know, man. My friend Tony buys manga there.”</p> \n<p>I take the wallet from the bleeding man’s back pocket. Its Nevada driver’s license has the name Christian Elders. That’s a much cooler moniker than Hawthorne.</p> \n<p>I swipe seventy in cash.</p> \n<p>“Who paid Hawthorne?”</p> \n<p>“He said some guy in Vegas. He didn’t say his name. He said it was years ago.”</p> \n<p>A beat.</p> \n<p>“Please, I want to leave. I just want to leave.”</p> \n<p>Blood has pooled on the floor, and I indulge in a few licks. Stuart makes a funny noise.</p> \n<p>“No wait-he did!” Stuart shouts. “He said it was Phillip Rousselout.”</p> \n<p>Hmm. . . Phil Rose. That guy was always an asshole.</p> \n<p>I lap up the rest of the blood. “Listen, I like you kid. You seem trustworthy.”</p> \n<p>The kid smiles with a furrowed brow and too many teeth.</p> \n<p>“I’ll let you go-”</p> \n<p>“Thank you, sir. I won’t tell anybody about this. I swear.”</p> \n<p>“-but I demand tribute,” I finish. “Give me your shoes and your belt.”</p> \n",
    "<p>“Shoes?”</p> \n<p>“Yes. Give me your shoes and your belt, and quietly walk out of here the back way. Easy as that.”</p> \n<p>“There’s like a foot of snow on-” He reconsiders this complaint, and withdraws it. Rather than say any more, he removes his sneakers, socks, and belt. He sprints away from me, holding his pants up by the fly.</p> \n<p>Sadly, the shoes are too big for my feet. I remove the laces.</p> \n<p>Hawthorne starts to regain consciousness, and I use the belt to fasten his legs together. I tie Marguerite’s legs together with the shoelaces. I load her onto my shoulder, and drag Hawthorne by his ankles to the back of the apartment.</p> \n<p>I set them on Sheila’s dining room table. Both are coherent before too long. Hawthorne lets out an animalistic growl and spits at me.</p> \n<p>I smile. “As the fella says, the worst of all conditions in which a belligerent can find himself is to be utterly defenseless.”</p> \n<p>Hawthorne grows serious. “I always knew that our dance would be to the death. Do your worst, demon.”</p> \n<p>“I’m sorry, do I know you?”</p> \n<p>“I’ve been tracking you for a decade! I had you pinned down in Circus Circus! I stabbed you through the shoulder!”</p> \n<p>“It’s not ringing any bells, pal.”</p> \n<p>Hawthorne screams at me. “You broke my arm in three places.”</p> \n<p>“Dude, I break a lot of arms.”</p> \n<p>Marguerite attempts to stare a hole through me and practices her cool stoicism in the face of danger. I tell her, “I don’t know what you see in this guy.”</p> \n<p>I turn back to Hawthorne. “I’m just curious. How much did Phil Rose pay you to kill me?”</p> \n<p>“I don’t owe you any answers, demon.”</p> \n<p>“What does all this have to do with the video store Blood Sucking Freaks?”</p> \n",
    "<p>Marguerite finally pipes up. “He says he doesn’t owe you any answers, monster.”</p> \n<p>“Actually, he said ’demon’, not ’monster’,” I correct. “And I bet your boss didn’t even realize that Phil Rose is a fucking vampire!”</p> \n<p>Hawthorne sits up straight and tall. “I’m done talking to you.”</p> \n<p>“Really?”</p> \n<p>Silence.</p> \n<p>“All right then.” I pick him up from the table. The back door of the apartment is still open from Stuart’s escape. His naked footprints go all the way to the alley. I step out onto the porch and casually throw Hawthorne over the railing.</p> \n<p>I don’t see how he lands because I don’t really fucking care.</p> \n<p>I walk back to the kitchen. Marguerite is trying to keep herself together, but her body is vibrating uncontrollably. “I’m sorry; I forgot to ask you to look out the window before I did that. You saw that, right?”</p> \n<p>Silence.</p> \n<p>“Good. Now, angel pie, you know the difference between you and me?”</p> \n<p>“I have a soul,” she states robotically.</p> \n<p>“No. Neither of us has one of those. The difference is that I believe most people are good. Doesn’t matter if they are white, brown, cops, queers, Muslims, Russians, or werewolves.”</p> \n<p>“You are not-”</p> \n<p>“Shut the fuck up. I have lived through a lot of conflicts. Each time, I see a few assholes leading a lot of good people into hating different people. For religion or patriotism or some such other no-good reason. And each time, it makes me sick, because I know that most communists are good people, and most Vietnamese are good people and most Iraqis are good people. You know why? Because most people are good people. In the end, this is why the hate-mongers always lose.”</p> \n<p>“You are insane.”</p> \n",
    "<p>I continue, “You, on the other hand, think it is okay to exterminate people who have never done any wrong to you. Why? Because of some shit you saw in some movies.”</p> \n<p>Silence.</p> \n<p>“Fucking movies.” I sit down on a dining room chair. “Now, I’m tired of looking at you. What do you know about Blood Sucking Freaks? I’m going to find out soon enough anyway.”</p> \n<p>“I don’t know what you are talking about.”</p> \n<p>“Margie, I ate your little reporter friend, and just threw your boss two stories off the goddamn porch. I think I deserve a straight answer. Tell me about Blood Sucking Freaks, and about Hugh and Richard.”</p> \n<p>“Honestly, I don’t what you are talking about. Hawthorne works alone. He makes his own stuff or buys it from Ace hardware. We don’t know anybody who does what we do. I’ve never met anybody named Hugh, and the only Richard I know is my uncle.”</p> \n<p>I get up from my chair.</p> \n<p>“Honestly, I can’t help you with any of this. You might as well just throw me off the porch, too.”</p> \n<p>I do that thing.</p> \n<p>I need a fucking cinnamon roll.</p> \n<h3 class=\"chapter\">Chapter 15</h3> \n<p>I lock Sheila’s back door and take a seat in her bathroom. I want everybody to clear out before I head off. I don’t want them to know Sheila’s apartment is empty again and I certainly don’t want to have an awkward scene with the cub reporter or anybody I just threw off of a porch.</p> \n<p>Sheila has no fewer than six candles in here, and none of them look used.</p> \n<p>I close my eyes, stretch my back, and think. I hear a soft cooing and a </p>",
    "<p class=\"noindent\">rocking noise. Both get progressively louder. I look up expecting plaster to fall on my face, but see only a ceiling with minor water damage.</p> \n<p>A lower moan joins the cooing sound.</p> \n<p>Years ago, I had this neighbor who would look out the window of her eighth floor apartment while having sex. I always wondered if it was because she liked to watch the world, or if she wanted the world to watch her. How does one judge such a thing?</p> \n<p>She seemed to enjoy getting her hair pulled.</p> \n<p>Enough time has passed. I leave after checking the locks compulsively.</p> \n<p>It is about a mile to that bakery. The air is still. I pass a few people bundled up like ninjas, one person wearing a SARS mask, and another wearing shorts and a hoodie. I pass a small contingent of drunk co-eds in cocktail dresses at University Avenue. They don’t seem to see me. I’m not bothered by this thing.</p> \n<p>I pass a fence post wearing a single mitten, and I am tempted to return its wave. I discard this notion as silly and unbecoming for a creature of the night.</p> \n<p>After fifteen minutes of strolling, I see Sheila through the glass front of the bakery and walk around to the door.</p> \n<p>The woman behind the counter barks at me, “We’re closing in five minutes!” Her features are soft and her hair is stiff. She is smiling, but still looks angry. A skinny white kid stands next to her, and he looks somewhat dazed.</p> \n<p>“All right. Can I have a cinnamon roll?”</p> \n<p>“Sold out of those at noon,” she informs me.</p> \n<p>The kid adds, “They were really popular today.”</p> \n<p>“How about some liver sausage?”</p> \n<p>The woman snaps a “no” at me, and the dazed kid chimes in that they “actually have that in the deli, but that has been closed for a few hours.”</p> \n<p>I smile at this two-headed bakery creature and turn to sit with Sheila. She’s nursing some sort of beverage.</p> \n",
    "<p>“Whatcha drinking?”</p> \n<p>“It is a red eye. It is like a caffeine boilermaker. Was everything okay?”</p> \n<p>“There were some pests at your place, but I took care of them.”</p> \n<p>“What do you mean?”</p> \n<p>I explain what happened, glossing over some of the details that make me look bad.</p> \n<p>“I do not like this, Ambrose. I do not feel safe. I do not feel like my own home is safe, and I do not think that you care.”</p> \n<p>“Look, I took care of it as best I can.”</p> \n<p>“What is to stop these same assholes or their friends or some new assholes to break into my place in the middle of the night or the middle of the day and start stabbing me through the chest?”</p> \n<p>“I don’t think-”</p> \n<p>“But you do not know. These guys are crazy, Ambrose. They are capable of anything.”</p> \n<p>“These guys aren’t capable of very much, Sheila.”</p> \n<p>“That is not funny, Ambrose. Every time you pop into my life, I drop everything and turn everything upside down to help you out and I do not know what is in it for me. I feel like you are using me and like that you are not a very good friend to have.”</p> \n<p>She makes a valid point that the back of my mind desperately wants to counter. I repress that urge.</p> \n<p>“I’m sorry. I’ve taken advantage of your friendship. Drive me back to your place, and I’ll give you a little token of my appreciation. I’ll spend the night with you tonight and then I’ll put you up in a hotel room until you feel safe.”</p> \n<p>Sheila raises an eyebrow. “I do not want to have sex with you.”</p> \n<p>“That is not what I’m offering.”</p> \n<p>“Ambrose, you do not have a window to throw your piss pot out of; how are you going to pay for a hotel?”</p> \n",
    "<p>“Just trust me.”</p> \n<p>She drives us to the six flat in silence. I give her back her house keys, and she unlocks the door. Sheila insists that I scout the apartment before she enters.</p> \n<p>I do this thing.</p> \n<p>“It’s safe, Sheila. I checked underneath the bed and everything.”</p> \n<p>“I do not like this. I am waiting in the hall.”</p> \n<p>“Fine.” I walk to her kitchen, open a junk drawer, and remove a Phillip’s head screwdriver and a flat-headed one.</p> \n<p>“What are you doing in there?”</p> \n<p>I am unscrewing the casing around her dining room light switch, but I don’t tell her that. Instead, I say, “Most vampires are, at the very least, legally dead. I don’t mean clinically so, but dead in such a manner that it makes it tricky to open a bank account, trade stocks, cash in a 401k, that sort of thing. No bank accounts means no checkbooks, no debit cards, no Visa, no Master Charge.”</p> \n<p>“What are you talking about, Ambrose?”</p> \n<p>I move the switch from the wall and find my string. “Well, they have to have a workaround to get walking-around money.” I pull the string, retrieve my prize, and start putting the switch back to normal. “Cash works fine, I guess, but these vampire folks don’t think it is classy. Most of the older ones hate the newer bills with the big faces. So, they keep their money in other ways.”</p> \n<p>“You are going to give me vampire money?”</p> \n<p>I step out of the apartment and tell Sheila to hold out her hands.</p> \n<p>“That there is gold bullion,” I say dropping the bar into her palms.</p> \n<p>“Like bullion cubes for soup?”</p> \n<p>“No. Like honest to god, gold-in-them-thar-hills gold.”</p> \n<p>“Real gold?” She does a hard blink.</p> \n<p>“Uh-huh.”</p> \n<p>“Is gold not like five-hundred dollars an ounce?”</p> \n",
    "<p>“Last I checked, is was about one thousand.”</p> \n<p>“How much does this weigh?”</p> \n<p>“About two, three pounds.”</p> \n<p>She raises and lowers her hands. “I thought two pounds of gold would be heavier. Gold is really heavy right?”</p> \n<p>“Two pounds weighs two pounds, Sheila.”</p> \n<p>“But, I mean, this is worth a nice car or something.”</p> \n<p>“So, we’re even?”</p> \n<p>“Ambrose, it is not about. . . This is so much money. Do I just turn this into the bank?”</p> \n<p>“I’ve never tried. I know a guy up on Devon and Washtenaw. He’ll pay you two-thirds market value and won’t remember who you are or what you look like if anybody asks him.” I write the exact address of the place on the back of my chicken sandwiches receipt. “Ask for Gopal, and tell him you are a friend of Max Thaler.” I write these names on the receipt and hand it to Sheila.</p> \n<p>“Who is Max Thaler?”</p> \n<p>“He’s. . . a friend of mine.”</p> \n<p>“Like Ambrose Chapel?”</p> \n<p>Sheila is smarter than I give her credit for. “Yup.”</p> \n<p>“You know-” She stops mid-sentence, fishes her cell phone from her coat pocket, and holds it up to her ear. “Mare, kumusta ka na?”</p> \n<p>We move things into the apartment, fears apparently conquered, and she continues her conversation. I understand very little of what is said.</p> \n<p>After about ten minutes she puts the phone back into her pocket and says, “That was my cousin.”</p> \n<p>“Wants the blood?”</p> \n<p>“No, not the blood cousin, the shorthand cousin. She read the first couple of pages, but she says she is not going to bother translating it because she says it is just some novel and that by the time she can translate it, you could just buy it.”</p>",
    "</p> \n<p>“It’s a novel?”</p> \n<p>“Yes, something about walking with monsters.”</p> \n<p>I am too stupid to live.</p> \n<p>“Was it called <u>I Walked with a Vampire</u>?”</p> \n<h3 class=\"chapter\">Chapter 16</h3> \n<p>I convince Sheila her apartment is safe enough by providing her the previously promised toe rub. I’m not really sure how the two correlate, but so it goes. I need to get back to Blood Sucking Freaks and get a copy of that goddamn book, but that’s gotta wait till tomorrow.</p> \n<p>So says Ivan, the terrible employee.</p> \n<p>I try to concentrate on the toes and not the churning in my gut. My gut says things are about to go south. I move a small toe around in a small circle.</p> \n<p>“Ambrose, when I think about it, I really do not know much about you.” Sheila says this as though it might be a question.</p> \n<p>“What you need to know, pudding?”</p> \n<p>“I do not know.”</p> \n<p>I massage the ball of her left foot with my thumb knuckle. If I get to the store as soon as night falls, I can start tracking down the author. It’s winter in Chicago, I’ve got to have about fourteen hours of darkness. I just hope he’s in Chicago. Shit. I need more information.</p> \n<p>“How about you tell me a secret about yourself and I tell you a secret about me?”</p> \n<p>“Sheila, my whole life is a goddamn secret.”</p> \n<p>“Well, then, just tell me something that you never tell anybody.”</p> \n<p>“Like what?”</p> \n<p>“Something personal, you know?”</p> \n<p>“All right,” I say, managing to think of something appropriate. “My mom went </p>",
    "<p class=\"noindent\">on a trip to see her sister when she was pregnant with me. She didn’t even know she was pregnant at the time and she just left my brother and my sister with my dad and drove however many hours away to see my aunt. She never told me why she made the trip, just that Aunt Helen needed her. She stayed with her for a few days or so, but the sisters ended up fighting, as sisters tend to do. I mean, there was something wrong with Aunt Helen that merited a spontaneous road trip, and my mom was pregnant. The way I figure it, an argument was inevitable. So, my mom goes to this diner, nothing fancy, and gets some blueberry pie. Whatever other details were hazy for her, she always remembered that it was warm blueberry pie.”</p> \n<p>“Blueberry is a good pie.”</p> \n<p>“The flavor is too strong for me. Anyways, she’s eating her pie and all of a sudden she notices this commotion. The place is suddenly buzzing and it all seems to be centered on the booth right behind her.”</p> \n<p>“Uh-huh.” Sheila is starting to get anxious.</p> \n<p>“So, my mom, she wants to turn and look but she’s feeling really embarrassed and self-conscious. But the ruckus is building, see. She has to turn around. At first she tries to be subtle. She’s trying to turn her head as little as possible. But then she sees who is there and all bets are off.”</p> \n<p>“Who was there?”</p> \n<p>“Harry and Bess Truman.”</p> \n<p>“The President?”</p> \n<p>“Former President and Former First Lady. My mom told me that after Harry Truman was president, he didn’t have much else to do. So he and his wife did a big road trip across America. So she got to meet President Truman. Shook his hand and everything. She tells me that the first lady was really quiet. And that the only thing she remembers about Bess is that Bess looked at her, my mom’s belly, and gave this weird smile. My mom used to act like Bess could see that I was in there. She would tell me that I was special because I met the president before I was even born. She told me that it made me special.”</p>",
    "</p> \n<p>I stop for a second. I hadn’t visited these memories in some time.</p> \n<p>“I used to love to hear her tell me that story. She told me to never tell my brother or my sister about it, because it would make them jealous. I’m guessing that it is okay to tell you, because you were probably not even born when Harry S. died. Bess lived a long time though. I was the third child. I didn’t get a lot that was my very own, and my mom made sure that I always had that.”</p> \n<p>Sheila smiled at me, and we let the room grow quiet.</p> \n<p>I wait another minute before breaking the silence, “Well?”</p> \n<p>Sheila paused. “Your story was very nice, and mine is embarrassing and I do not want to tell it anymore.”</p> \n<p>“This was your idea, Sheila. Spill.”</p> \n<p>“Okay, fine. There was this one time when I drank too much and I peed in bed.”</p> \n<p>“That’s it? That’s your secret? You drunkenly peed your bed?”</p> \n<p>A pause.</p> \n<p>A squirm.</p> \n<p>“It was not my bed.”</p> \n<p>Interest growing.</p> \n<p>“Whose bed was it?”</p> \n<p>“I do not think he ever told me his name.” As soon as she finishes saying this thing, she starts giggling uncontrollably and hitting me. “Shut up!”</p> \n<p>“Are you telling me that you peed some guy’s bed during a one-night stand?”</p> \n<p>“Shut up.”</p> \n<p>“What did you do?”</p> \n<p>“I threw out my panties, put my clothes back on, and sneaked out of his house. Then I ran for two miles to my house. Do not run for two miles when you are drunk. It makes you feel real bad in the morning.”</p> \n<p>“I should think so.”</p> \n",
    "<p>Some time later, Sheila falls asleep. I shut her in the room and sit on the floor on the other side of her bedroom door. I develop theories and contingency plans between catnaps.</p> \n<p>After a few more hours, Sheila gets up and gets ready for work. I plop myself into the darkest corner I can find and continue plotting/resting.</p> \n<p>Before she walks out the door, Sheila takes the time to say goodbye. She knows I’m not going to be here when she gets back. She turns to leave, stops, and throws me something that jingles.</p> \n<p>“Next time,” she says, “do not break in.”</p> \n<p>I stop myself from telling her that she left her damn door unlocked. Instead, I clutch the set of house keys in my left hand and say, “Thank you.”</p> \n<p>The thanks are genuine.</p> \n<h3 class=\"chapter\">Chapter 17</h3> \n<p>I slide under the bed and kill a few hours till nightfall. Sheila has dust bunnies; I grab a few handfuls and throw them into the toilet. At dusk, I steal a flathead screwdriver and a book of matches from Sheila’s junk drawer, then go for a tin of lighter fluid from under the sink.</p> \n<p>I tuck the screwdriver into my back pocket.</p> \n<p>I think about how the world is constantly changing.</p> \n<p>I dump the backpack out onto Sheila’s table, and start sorting. Essentials, like my jar of peanut butter, go back in. Non-essentials, like those notebooks and Hugh’s prom photo go into another stack.</p> \n<p>This next generation of kids will never buy a cassette, will never own a black and white TV, and will probably never hear a dial tone.</p> \n<p>Most things from the book bag go into the second stack, which subsequently finds itself on the bottom of Sheila’s kitchen sink. I squirt the pile liberally with the lighter fluid and drop a match.</p> \n",
    "<p>Vampires are innately static. They stop changing in order to live forever.</p> \n<p>Papers curl and change colors. Smoke forms.</p> \n<p>The world changes around them, and they stay the goddamn same.</p> \n<p>Sure enough, the smoke alarm goes off. It’s an awful sound. I knock it off the ceiling with a broom handle. This same thing happened to me years ago. Right in this very same kitchen, back when Sheila’s dog was still alive. The dog freaked out, ran into the kitchen, and shit all over the floor.</p> \n<p>Maybe the cost of living forever is to stop growing and changing and experiencing new things. That can’t be because isn’t that death?</p> \n<p>I use the sink sprayer to put out the fire, and spread the remains into three different trash cans.</p> \n<p>I draw a picture of a giraffe on Sheila’s whiteboard, and lock up behind me.</p> \n<p>As I head east, towards the video store, I scout cars. I’m looking for something cheap and made before 1995, but the affluence of the neighborhood limits my selection somewhat. Chance is on my side and I find a beat-up hatchback wagon. It’s got more snow on it than the surrounding cars. I figure that thing to be a good thing, noting its location for later.</p> \n<p>The jingling bell invites me into Blood Sucking Freaks. A young woman with dark hair and blue eyes welcomes me. Her eyes are big, the sort that always look frightened.</p> \n<p>“Can I help you?” She asks this thing politely but robotically.</p> \n<p>“Actually, yes. I was looking for a copy of <u>I Walked with a Vampire</u>. Ivan told me that Katie could help me out.”</p> \n<p>“That’s me. Picking it up for your daughter?“ She asks while typing something into the computer.</p> \n<p>“Sure. Why not?”</p> \n<p>“Well, we sold them all. All’s I got left is pre-sales,” Katie says this, motioning towards something behind the counter that I could not possibly see.</p> \n",
    "<p>“Really? All of them?”</p> \n<p>“Right away. This store is kinda like the author’s home base. She used to come in here all the time.”</p> \n<p>“That so?” I wonder if this is the sort of thing one can find at Borders. Vampire books are everywhere now, right?</p> \n<p>“Yeah. Now she sends this big dumb guy here instead. I haven’t seen her in like two years.”</p> \n<p>“That’s a shame. Listen, is there any way I can see a copy of the book. I just want to flip through it.”</p> \n<p>“Sorry. They’re all cellophaned and everything. Is there a chance your daughter pre-ordered it?”</p> \n<p>That could work. “Maybe.” Fake daughter name, fake daughter name. . . What are teenage girls named nowadays? Stupid stuff, right? Like Brittany, Taylor, Alexis, Brianna-</p> \n<p>“Oh, and there are a coupla free copies she left behind.” Katie mercifully interrupts this chain of thought.</p> \n<p>“Who?” Why would my fictional daughter leave anything behind? Oh, my brain is fuzzy today.</p> \n<p>“Whaddya mean ’who?’ The author. She gave us a bunch of free copies of the book for a whole list of names. Well, Owen left us the books and the list, but you know what I mean.”</p> \n<p>“I’m afraid I don’t.”</p> \n<p>“It’s like swag.”</p> \n<p>“No, I understand that. Who are these people on the list. Regular customers? Friends of hers?”</p> \n<p>“Oh no,” she corrects me. “I’ve never seen any of these people. Least, not that I know of. She just gave us this whole list of ’inspirations’ for the book. I guess these are the dudes who she based her vampire character offa. Kinda weird if you ask me.”</p>",
    "</p> \n<p>“A little.” Wait a minute.</p> \n<p>My intestines decide to move around more than usual.</p> \n<p>Fuck it.</p> \n<p>I got to know.</p> \n<p>I ask: “Would any of those names happen to be Ambrose Chapel, or Max Thaler?”</p> \n<p>“Well, you just named half the list! You only missed Robert Jones and Walter Neff.”</p> \n<p>Oh, I don’t like this feeling in my stomach. Not at all.</p> \n<p>“Well, Katie, it just so happens that I have an ID that says Ambrose Chapel.” I also have an ID that says Walter Neff, and one that says Max Thaler. I don’t have any left that say Robert Jones though. That one takes me back.</p> \n<p>“Really?”</p> \n<p>I show her this thing, and she hands me a copy of <u>I Walked with a Vampire</u> by Bessie Zaleska.</p> \n<p>I leave the store, rip open the cellophane, and curse. It’s got a message for me on the inside of the jacket: “I still live in the same place. Stop by anytime. It’s not like I’m going anywhere.”</p> \n<p>I back track to the wagon. The good thing about hatchback wagons is that a solid third of the people who bought them forget to lock the hatch.</p> \n<p>I climb in through the back.</p> \n<p>Modern cars have chip keys. This means stealing them involves prying open this and stripping that and disabling the other. A lot of the older cars, however, can be stolen in a more primitive and satisfying way.</p> \n<p>I take the flathead out of my pocket and use it to break the steering wheel lock. Then, I shove the screwdriver into the ignition and hit the base of it sharply with the heel of my hand.</p> \n<p>I turn the screwdriver and the car starts.</p> \n",
    "<p>I drive halfway to Bridgeport; I know that is where I’m going.</p> \n<p>But first, I have some reading to do.</p> \n<h3 class=\"chapter\">Chapter 18</h3> \n<p><u>I Walked with a Vampire</u><u></u></p> \n<p> </p> \n<p> <b><i>Chapter 12</i></b></p> \n<p><i> </i></p> \n<p><i>Helen was dying, and Betty knew it. Though she hadn’t officially spoken with her sister in many, many years, Betty still felt close to her. From a distance, she watched Helen for a long time. She watched her children grow older and have children of their own. It was as though Helen were a bridge to her past, to her old life.</i></p> \n<p><i>And Helen was dying.</i></p> \n<p><i>Betty could feel an emptiness swell inside her. She had watched Helen’s body grow older and weaker, while Betty’s grew stronger. But Betty felt as though her own soul was dwindling while Helen’s grew in strength and happiness and family.</i></p> \n<p><i>Helen was dying and Betty felt lost. She had no direction for the future and was losing her connection to the past. She felt not sadness, but a hollowness, a numbness.</i></p> \n<p><i>Helen was dying; Betty thought that she might not need to.</i></p> \n<p><i>Betty walked all the way to the hospital as a light rain spotted the sidewalk beneath her. The spots grew and connected.</i></p> \n<p><i>Betty needed the walk. She needed time to think, time to relax, time to prepare her words. Was she crazy?</i></p> \n<p> </p> \n<p>**</p> \n<p> </p> \n<p>Blah, blah, get on with it, Zaleska. Let’s see. Betty sneaks in after visiting hours. Betty walks into the wrong room. Betty almost gets caught by an “Afro-American security guard”.</p> \n<p>Really?</p> \n<p>Sweet baby Jesus, what year did she write this thing?</p> \n<p> </p> \n",
    "<p>**</p> \n<p><i> </i></p> \n<p><i>Startled, Helen sat up straight in bed, and immediately regretted it. All she could think to say is “Am I dead?”</i></p> \n<p><i>“Not yet, maybe not ever,” Betty replied, as she played with a curtain in the middle of the room.</i></p> \n<p> </p> \n<p>**</p> \n<p> </p> \n<p>Drama, drama, drama. Helen thinks she’s a ghost. Betty says she’s real; touching reunion. Betty explains vampirism; crushing rejection. Blah Betty, blahbitty. Sisterly make-up, but Helen still won’t join Betty in the world of the undead.</p> \n<p>Living forever as a frail old woman would kinda suck, huh?</p> \n<p> </p> \n<p>**</p> \n<p><i> </i></p> \n<p><i>“I can save you. I don’t have to lose you,” Betty shouted. “You don’t have to die.” Tears streamed down her face.</i></p> \n<p><i>Helen smiled in a queer way. “Everything dies, Betty. Everything has to die.”</i></p> \n<p><i>Betty raged, grabbing the metal bar holding the curtain and smashing the entire apparatus into the wall behind her. Betty spent thirty seconds regretting.</i></p> \n<p><i>Then she realized that her sister’s room was only semi-private. Another patient was watching her as she tried to compose herself.</i></p> \n<p><i>He was fairly young, of average size, and had dark features. As he sat up in bed, he moved a copy of <u>Red Harvest</u> from his lap and set it on the side table.</i></p> \n<p><i>Helen started to laugh at the ridiculousness of the situation, and asked, “Betty, have you met my friend, Bob? He’s got acute myeloid leukemia. That’s right, right Bob?”</i></p> \n<p><i>“Close enough,” Bob responded. “So, Betty, I know I’m not family or anything, but I would kind of like not to die.”</i></p> \n<p><i>Betty didn’t realize that her next decision would change her life forever, and make the next month a living hell.</i></p> \n<p><i> </i></p> \n<p><i>**</i></p> \n<p> </p> \n",
    "<p>I spend another twenty minutes reading before driving to Bridgeport. I don’t learn much.</p> \n<p>A blue Chevy Cobalt tries to pass me on the right at 26th Street and Shields. I force it off the road and into one of those poles that hold up the Dan Ryan Expressway. I pin it there with the station wagon. Today is a productive day.</p> \n<p>Of course the man driving the Cobalt starts cursing me. I scooch over to the passenger seat, roll down the window, and convince him to do the same. I break his nose and slide back over to the driver seat.</p> \n<p>I get out of the station wagon, leaving the door open and not looking back. It’s only a ten block walk from here.</p> \n<p>I consider using the walk to gather my thoughts, but it makes me feel like the protagonist of that goddamn book. I try to stop thinking altogether. That’s no good.</p> \n<p>I’m a friggin’ mess.</p> \n<p>The house is just like I remember: an earth-colored box with an ugly awning next to a different earth-colored box with an uglier awning. My hand goes towards the makeshift lock picks in my pocket, but I hesitate, remembering that this as a cop neighborhood. I try the doorknob for the hell of it, but it doesn’t even turn.</p> \n<p>My plan for my next move is interrupted by a -BUZZZ.</p> \n<p>I push my way through the door and am immediately struck by the feeling that I’m making a mistake. The fact that I don’t see anyone around adds to this feeling. I hear music coming from upstairs. It sounds like big band.</p> \n<p>I walk down a short hallway and turn right. Something stands in my way. I look up, then I look up some more and see that it has a face.</p> \n<p>He grabs me by the neck with both hands and lifts me off my feet. He develops a satisfied smirk. I grab his left wrist with both my hands, swing my right leg over his left arm, and attempt to kick that smirk off his face.</p> \n<p>My kick distracts him enough to loosen his grip on my throat, and I hold onto his left arm with both hands and both legs. I try to take him to the ground and hyperextend his elbow.</p>",
    "</p> \n<p>It’s a mistake. He’s too strong. He lifts me into the air with just his one arm and swings me into a ceiling fan. I’m not sure what happens immediately after that. I remember flying through the air and hitting a ceiling and then a wall. Maybe it is the other way around. At any rate, I find myself in the kitchen.</p> \n<p>Serves me right for trying that flashy shit.</p> \n<p>I’m not sure what hits me next, but I hear a cracking sound before everything goes black.</p> \n<h3 class=\"chapter\">Chapter 19</h3> \n<p>Blackness flees to my peripheral vision. Pain squeezes my wrists. I can hear a blender. Where is my shirt?</p> \n<p>I want to go back to sleep, but a twisting thing in my gut tells me I shouldn’t.</p> \n<p>I shake my head and immediately regret that decision.</p> \n<p>Handcuffs are around my wrists, and from those I find myself hanging attached to a karabiner in what looks to be some sort of basement. I’d say a dungeon but there is a water heater in the far corner. Stretching my toes as far down as possible, I still find them a good two inches from ground. I hear the blender grow louder.</p> \n<p>Oh shit, it’s a saw.</p> \n<p>The large man, who I presume to be Owen, takes a step forward, contemplating the whirring thing in his hand. Its blade is the size of a Kennedy half-dollar. He’s wearing one of those plastic face shields that go up and down like a knight’s visor. It is currently down.</p> \n<p>My body feels warm and heavy. An attempt at swinging on the karabiner proves fruitless. “Hey, mister. This is just a big misunderstanding. I’m just here for the Census. We have a few follow-up questions from your form.”</p> \n<p>Owen gets closer with the saw.</p> \n<p>Okay, so that didn’t work; coming up with cover stories is hard after receiving a massive blow to the head.</p> \n",
    "<p>Before I can attempt a new lie, I feel a pinch in my abdomen. He has thrust the saw into me, right below my chest. I can feel the spinning blade slow down as it chips away at my sternum.</p> \n<p>Well, I’m awake now.</p> \n<p>Owen tries to muscle the saw up through my ribcage, but stops when his visor gets splashed with my blood. It is lighter in color than a fresh peach.</p> \n<p>He stops the saw, sets it on a stool, picks up a rag, and starts turning on every light he can find.</p> \n<p>He wipes my flesh-colored blood from his visor and stares at the rag. I look down into my wound as best I can and find my insides fairly monochromatic. Slow moving blood slides down my belly and stains my pants.</p> \n<p>Owen gets on his hands and knees and examines a puddle of my blood on the floor. He starts to lap it, cautiously at first, but ending enthusiastically.</p> \n<p>“I am at a bit of a loss.” This is the first thing I’ve heard Owen say. He then moves to some place I can’t see. I hear a sound like footsteps on stairs. I slow my breathing and wiggle my fingers as best I can. The pain in my wrists feels a lot better now by comparison.</p> \n<p>I can just reach the karabiner with the tip of my left thumb. Trying several times to open it by pushing convinces me that it’s one of the ones with a gate that screws shut instead of springs shut. Twisting my body at an awkward and painful angle allows both of my thumbs to work in concert to spin the gate.</p> \n<p>Which fucking way is lefty loosey?</p> \n<p>I’ve started to loosen the karabiner when I see Owen return. Possum is currently the only card in play. He has a small flashlight in one hand and what looks like a test tube in the other.</p> \n<p>I stare at him through my eyelashes. He squats down right in front of me, not noticing my left thumb continuing to turn the gate.</p> \n<p>Owen moves the small black flashlight into his mouth, and holds the test tube in front of my belly, right underneath the saw wound.</p>",
    "</p> \n<p>With his left hand, he sticks his thumb into my wound and yanks as though he were opening a can of sardines. He twists the hole open and collects a sample of my blood.</p> \n<p>The gate squeaks, softly.</p> \n<p>I swing as hard and as fast as I can. My right shin finds its way over Owen’s left arm and into his jaw. The metal flashlight makes an awful noise against Owen’s front teeth before falling to the ground. I hold my right leg in front of his neck while I drape my left knee over his right shoulder.</p> \n<p>I hope this fucking works.</p> \n<p>Owen straightens up, startled, allowing me to slip the handcuffs from the loosened karabiner. Still holding on with my legs, and trying to ignore significant pain, I pull my upper body forward and manage to get the handcuff chain behind Owen’s head.</p> \n<p>I jerk back with both hands and the chain, pulling Owen’s head towards me, while pushing back against his neck with my right leg with enough force to kill most men. Owen writhes somewhat.</p> \n<p>I pull back even harder, causing Owen to flail, but also snapping the chain to the handcuffs. I manage to keep myself from falling backwards by grabbing both of his ears.</p> \n<p>This causes Owen to make a noise that is half grunt half scream. It’s at this point that Owen figures out he is standing, while I am suspended in air.</p> \n<p>Owen falls forward, sending me to the concrete floor with enough force to crack it. I re-grip his ears beneath my knuckles, stick both my thumbnails into his eyes. The right one finds its way in. Owen slithers his body, unable to get the leverage to lift me back into the air but more than able to send my ribs repeatedly into a metal pole.</p> \n<p>I can’t maintain my grip on his ears, so I move my left leg behind Owen’s head and grab my foot with both my hands. Scissoring his neck between my shins, I pull back as Owen smashes me into the pole for a fifth time. I pull back until I hear a crack.</p> \n",
    "<p>Owen slumps. I push his weight off of me and roll to my feet. A workbench stands a few feet behind me. I grab a handful of paper towels and hold them up to my chest. I wind a roll of duct tape around that and break off the end with my teeth. My coat lies on a nearby metal shelf. I grab it and put it on.</p> \n<p>It’s not much of a look.</p> \n<p>I turn around when I hear the sound of vomiting. Owen rises to his feet on one hand and throws up a second time. He manages to stand up straight, save for his head tilting at a peculiar angle. His left eye is leaking some liquid I’ve never seen before.</p> \n<p>“I am trying to save her.” He says this, doubles over, steadies himself, then takes a step forward. The stool with the saw is just out of reach, so I snatch a framing hammer from the workbench.</p> \n<p>“Stand the fuck back, Owen.” I spin the hammer in my hand so that the claw faces forward.</p> \n<p>“Bessie is dying. She is all I have.” Another step.</p> \n<p>“Well, that’s really swell.”</p> \n<p>“I need your heart.” Another step.</p> \n<p>“Still using it, chief.”</p> \n<p>“I’m sorry.”</p> \n<p>Another step.</p> \n<p>“Back up,” I command with as much courage as I can muster.</p> \n<p>Owen puts his head down and charges. I sink the claw end of the hammer half an inch into the back of his head and use it to pull his face into my quickly moving knee. His nose bends an inch to the right and stays that way.</p> \n<p>Owen stumbles backwards, the hammer still in his head like a wooden cowlick. I kick him in the belly button as hard as I can. He takes a few steps back and involuntarily sits down.</p> \n<p>He says, “I don’t feel good.” I believe him.</p> \n<p>“Didn’t you read the book that was written by the love of your life?”</p> \n",
    "<p>“What are you talking about?” He asks this with one eye focused on me.</p> \n<p>“Chapter thirteen. Chapter thirteen of her damn book was all about when Bessie became my sponsor. It was all about how drinking my blood damn near killed her.”</p> \n<p>“You’re lying.”</p> \n<p>I laugh like a supervillain; it is hard not to. “Maybe it’s because my dad rolled uranium for Bethlehem steel, or maybe it was because I went to school in the goddamn Love Canal. Maybe it was my leukemia, or maybe the treatment I got for leukemia. Even mosquitoes seemed to figure out not to bite me.</p> \n<p>“Son, I’m goddamn poisonous.”</p> \n<h3 class=\"chapter\">CHAPTER 20</h3> \n<p>I follow the sound of the big band music upstairs and walk to the end of a short hallway with paneled walls. I knock on the door I find there.</p> \n<p>The music stops.</p> \n<p>“Come in,” says a familiar voice.</p> \n<p>I do that thing.</p> \n<p>Bessie puts a remote on a nightstand and says, “Owen always calls that my Tom and Jerry music. Oh Bob, I was hoping you wouldn’t have to see me in this. . . state.”</p> \n<p>I examine her state. Bessie is propped up in bed, wearing a dingy green robe. She doesn’t look much older, but she seems to be lacking in certain ways. Namely, her right arm below the elbow, the two smallest fingers on her left hand, the tip of her nose, and (I can’t tell for sure because of the blanket) her feet: they are all missing.</p> \n<p>“What on Earth did you do to yourself, hon?”</p> \n<p>“It’s a long story that isn’t very flattering. The quick details are that I woke up not feeling like me, freaked out, and made a series of lousy decisions. Long story short, I’m dying.”</p> \n",
    "<p>“Owen said.”</p> \n<p>“He’s a nice boy. I hope you didn’t kill him.”</p> \n<p>I smile.</p> \n<p>Bessie doesn’t return my smile. “Can I ask you a favor?”</p> \n<p>“Listen, you were my sponsor, and I love ya, but I’m not going to give you my heart, Bessie.”</p> \n<p>“No,” she says, “Light this for me?” Bessie pulls a cigarette from the pocket of her robe.</p> \n<p>I oblige.</p> \n<p>“You look good, Bob.”</p> \n<p>“Thanks.”</p> \n<p>“Shorter than I remembered.”</p> \n<p>“Same height since 1970.”</p> \n<p>“Well. I’m sorry about all this heart nonsense. Owen thinks that if he slaps a fresh vampire heart into my chest, it’ll fix all my problems. He doesn’t want me to die.”</p> \n<p>“You seem ambivalent to the prospect.”</p> \n<p>“That’s one way of putting it. Part of Owen loves me like a high school sweetheart, part of him loves me as though I were his mother. In a way, I sort of am. The rest just worries about some stupid shit he saw in a movie about how he’ll turn human again if the head vampire dies.”</p> \n<p>“A lot of the vamps in Vegas seem to think that.”</p> \n<p>“They’re idiots who spend half their time drinking each other’s blood to protect them from a dumb idea. You didn’t kill Owen, did you?”</p> \n<p>“He’ll be okay.” I’m not basing that assessment on anything in particular. “Bess, you ducked my last question.”</p> \n<p>“I did. Part of me says I’m already dead. I don’t think I’m me anymore. I’m a collection of tiny, light sensitive, blood-loving parasites pretending to be me. It’s like I became a vampire so I could die slowly and let these parasites be immortal.”</p> \n",
    "<p>“And the other part?”</p> \n<p>“Bob, the other part is just tired. I’ve done and seen and done seen everything I care to. I’ve seen pole-sitting, phone phreaking, streaking, those little baby beaners, and all the wars and death and people complaining about how we’re all going to die any day now for a hundred years. Hell, I’ve even got to see the country elect a negro president. You know, I had a great-uncle who owned a negro.”</p> \n<p>“I know that, Bessie. That’s not really the preferred term.”</p> \n<p>“Better than some of the ones I’ve heard. Bob, my sister died almost 30 years ago, but she has 40 great-grandkids running around keeping her alive. And here I am with nothing but a bunch of parasites to keep my corpse moving around.”</p> \n<p>“Hold on a minute. You wrote that book with three fingers?”</p> \n<p>“No, I have a girl who comes by and takes dictation.”</p> \n<p>“And you have Owen?”</p> \n<p>“Yes.”</p> \n<p>“Stop pitying yourself then. You friggin’ baby.”</p> \n<p>“Did you come all this way just to mock me?”</p> \n<p>“No, I came all this way to get a goddamn hole sawed into my goddamn chest. Mocking you is a party bonus.”</p> \n<p>“I’ve been in this longer than you, Bob. I think-”</p> \n<p>“Bess, we all get into ruts sometimes. It’ll get better. In fact I guarantee it.”</p> \n<p>“How?”</p> \n<p>I put out Bessie’s cigarette and wrap her in her blankets. I throw the makeshift bindle over my shoulder and tell her, “We’re going on a road trip!”</p> \n<p>Now, I just have to find a good car to steal.</p> \n<p>It’ll need a big trunk.</p> \n<p> </p> \n<p><b>A Quick Piece for an Easy Buck</b></p> \n<p><b> </b></p> \n<p><b>a bonus Short by</b></p> \n<p><b> </b></p> \n<p><b>M. L. Kennedy</b></p> \n<p> </p> \n",
    "<p>Two men entered the Relax-Station out in Erie, Pennsylvania. The Relax-Station there was like any number of Relax-Stations across the country, or any number of similarly franchised motels owned by the same large company.</p> \n<p>It smelled in that way that only motels do.</p> \n<p>Between both men, they carried, rolled or dragged seven bags; six of these bags matched in style and pattern. The first man, who carried only matching bags, stepped up to the desk. Behind that desk sat a blonde with unfashionable glasses, reading the fifth in an interminable series of fantasy books.</p> \n<p>“We should have a reservation,” he said, scanning her small frame, paying particular attention to the nail on her right index finger. It was significantly shorter than the others.</p> \n<p>“Then you must be Mr. Brice,” the clerk said, as she reluctantly set down her novel.</p> \n<p>“Call me Billy,” said the man who carried only matching bags.</p> \n<p>“Okay,” she responded, never intending to do that thing. She handed Billy a small paper folder containing two plastic cards, the keys to the room. Each key was decorated with a picture of a pizza, and directions on obtaining said pizza or any number of similar pizzas.</p> \n<p>“It’s non-smoking, two double beds. Take the stairs to your left, and it is the first room you’ll hit.”</p> \n<p>“Oh, no. I requested a room with one king-size bed.” Billy paused, pleased with his own joke. “I’m just kidding,” he confessed. “James, you should see the look on your face,” Billy added, pointing to the man who carried mismatched bags.</p> \n<p>The look on the face of James was the one he normally wore.</p> \n<p>The two banged their luggage up the flight of stairs. Billy Brice swiped his key card and waited for the subsequent green blink with the concentration of a safe cracker. James paused to grope the small plastic box in his own coat pocket, and to contemplate many of his past decisions.</p> \n",
    "<p>Billy dropped his bags between the far bed and its adjacent wall.</p> \n<p>“Now James, just because you bought me dinner, doesn’t mean I gotta put out. I’m just kidding, of course.”</p> \n<p>“The magazine bought you dinner,” corrected James. The magazine in question was Cryptid. It was one of the nation’s three best-selling cryptozoology magazines, and an invaluable resource to any number of very serious and important men who were trying to capture Bigfoot or the monster in Lake Champlain.</p> \n<p>“Oh yeah. The magazine. Well, I’ll tell your magazine this: my job was a lot easier 20 years ago when Jerry Garcia was still alive and the Grateful Dead were still in full force. The buggers liked to follow the Dead, and pick off Deadheads. I guess they figured that nobody’s gonna notice a couple fewer hippies on the bus. Who’ll even report ’em? Missing missing person.” Billy chuckled at this term.</p> \n<p>James pushed a button on the plastic box in his pocket. A tiny sprocket turned, squeaking.</p> \n<p>“Nowadays,” Billy continued, “nowadays? Twenty-three hundred people get reported missing every day in this country. It is close to absolutely impossible to tell which ones were nabbed by the buggers, and which ones are regular murders or runaways or. . . I tell you, I investigated this one case for three weeks. Kid vanished. I was sure and a half that it was the buggers. I was all set to save him and rain down the wrath uh God. And you know what? After three weeks of work, the kid calls from his daddy’s house.” Billy rested on the far bed. “Crazy world, huh? Tell me, you’re not going to make me sound like a nut, right?” These two separate thoughts/questions came out as one.</p> \n<p>“I’m just going to observe, record, and report.” James was telling the truth, though his motives for acting in this manner were not out of respect for his subjects. He remained disinterested in his writings for two monetary reasons. The first was to avoid getting sued. The second reason was one that developed from his long career as a freelancer. If he was neutral and detached he could sell his columns to the tin foil hat crowd, and those who laugh at the tin foil hat crowd.</p>",
    "</p> \n<p>It was win-win.</p> \n<p>James put the recorder on the night-stand, roughly four inches above the book of Mormon and the bible of Gideon. “Do you fear sounding like a nut?”</p> \n<p>“Not really,” chuckled Billy. “I’m doing what my daddy did, and what his daddy did. I come from a long line of hunters. It’s not some fly-by-night operation like those Chupacabra guys.” A beat. “I’m pretty sure that thing is made up.”</p> \n<p>“Do these bags contain your hunting equipment then?”</p> \n<p>“Thems and my underpants.”</p> \n<p>“Where does one come about such equipment? I don’t believe that, say, Walmart has an aisle devoted to-”</p> \n<p>“Well, some I built, some my granddad built, and some is just regular hunting equipment, for all the good that’ll do me.”</p> \n<p>“Do any of the bags contain remains of your catches or anything of that sort?”</p> \n<p>“Well, no. I got nothing like that. There ain’t no heads in the duffel bags or any such nonsense like that. Nine times out of ten, I’m set out to be more of a deterrent. You know? Scare the buggers away.”</p> \n<p>“How many have you killed?”</p> \n<p>“How many have I personally killed?”</p> \n<p>“Yes,” replied James while trying to hide the fact that he believed this to be a very stupid question.</p> \n<p>“Well, none,” Billy stated before he decided to add, “that I can prove. None that I know for sure.”</p> \n<p>James had anticipated as such. This job had done little to deter his natural skepticism about legendary creatures and the paranormal. At the very least, it seemed as though monster hunting was of the catch and release sort.</p> \n<p>Billy Brice spent the next half hour showing James five bags worth of equipment. Billy claimed one was to make an ultrasonic noise that the creatures detested. Another could track their movements based on electromagnetic fields. Many </p>",
    "<p class=\"noindent\">contained seemingly superfluous light emitting diodes, and James rather quickly deduced that Billy had no idea as to the proper meanings of the words “quantum” or “latent”. He said that only three percent of the population could even detect these monsters, though he admitted to “guesstimating” that number.</p> \n<p>“Listen, Mr. Brice-”</p> \n<p>“Billy.”</p> \n<p>“Yeah, do you have anything I can take a picture of that would serve as evidence for the existence of-”</p> \n<p>“You don’t believe me?”</p> \n<p>“It’s not my job to believe you or to not believe you. I was just hoping to acquire some evidence that-”</p> \n<p>“Evidence? Evidence? Man, I’ve seen these buggers with my own two eyeballs, and you want evidence.” Billy removed his jeans, revealing a large puncture wound on his thigh.</p> \n<p>“How’s that for evidence? Huh? You take a look at that!”</p> \n<p>James replied flatly, “it’s evidence of a wound. You cou-”</p> \n<p>“Jesus Christ boy!” Billy Brice said this thing as though he had never felt as much frustration in his life. He exhaled sharply. “What will it take for you to believe that Unicorns are real!?”</p> \n"
]